<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  




<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="persuing happiness">
<meta property="og:type" content="website">
<meta property="og:title" content="zhuimengfb's blog">
<meta property="og:url" content="http://yoursite.com/index.html">
<meta property="og:site_name" content="zhuimengfb's blog">
<meta property="og:description" content="persuing happiness">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="zhuimengfb's blog">
<meta name="twitter:description" content="persuing happiness">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: 'Author'
    }
  };
</script>

  <title> zhuimengfb's blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="en">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?32cc932d4c165744315fa3da1f8a235a";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left 
   page-home 
 ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">zhuimengfb's blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            Home
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            Archives
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            Tags
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            
  <section id="posts" class="posts-expand">
    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2017/01/08/人啊，只能专心做一件事情/" itemprop="url">
                  人啊，只能专心做一件事情
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">Posted on</span>
            <time itemprop="dateCreated" datetime="2017-01-08T20:50:50+08:00" content="2017-01-08">
              2017-01-08
            </time>
          </span>

          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2017/01/08/人啊，只能专心做一件事情/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2017/01/08/人啊，只能专心做一件事情/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x4E00;&#x4E2A;&#x65B0;&#x5E74;&#x521A;&#x8FC7;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x65B0;&#x5E74;&#x53C8;&#x8981;&#x6765;&#x4E86;&#x3002;&#x4ECE;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x8BB2;&#xFF0C;&#x5C06;&#x8981;&#x6765;&#x7684;&#x90A3;&#x4E2A;&#x65B0;&#x5E74;&#x8C8C;&#x4F3C;&#x4F1A;&#x66F4;&#x52A0;&#x70ED;&#x95F9;&#x4E00;&#x70B9;&#xFF0C;&#x6253;&#x724C;&#x7684;&#x6253;&#x724C;&#xFF0C;&#x6253;&#x9EBB;&#x5C06;&#x7684;&#x6253;&#x9EBB;&#x5C06;&#xFF0C;&#x6BCF;&#x5929;&#x5230;&#x4E03;&#x5927;&#x59D1;&#x516B;&#x5927;&#x59E8;&#x5BB6;&#x91CC;&#x8E6D;&#x5403;&#x8E6D;&#x559D;&#xFF0C;&#x60F3;&#x60F3;&#x5C31;&#x5F00;&#x5FC3;&#x3002;&#x6240;&#x4EE5;&#x554A;&#xFF0C;&#x867D;&#x7136;&#x79BB;&#x6625;&#x8282;&#x8FD8;&#x6709;&#x5927;&#x534A;&#x4E2A;&#x6708;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x5176;&#x5B9E;&#x5FC3;&#x91CC;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x7ED9;&#x81EA;&#x5DF1;&#x653E;&#x5047;&#x4E86;&#x3002;&#x8981;&#x4E0D;&#x662F;&#x8FD8;&#x6709;&#x4E2A;&#x5F00;&#x9898;&#x8981;&#x505A;&#xFF0C;&#x8BF4;&#x4E0D;&#x5B9A;&#x8FDE;&#x8EAB;&#x4F53;&#x4E5F;&#x5F00;&#x59CB;&#x653E;&#x5047;&#x4E86;&#x3002;&#x5509;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x70B9;&#x5C0F;&#x5C0F;&#x538C;&#x5B66;&#xFF0C;&#x4E0D;&#x8FC7;&#x5462;&#xFF0C;&#x6BCF;&#x4E2A;&#x6708;&#x90FD;&#x6709;&#x90A3;&#x4E48;&#x4E00;&#x4E24;&#x5929;&#x4E0D;&#x60F3;&#x5B66;&#x4E60;&#xFF0C;&#x5C31;&#x4E0D;&#x8C08;&#x8FD9;&#x4E9B;&#x4E86;&#xFF0C;&#x8FD8;&#x662F;&#x6765;&#x70B9;&#x6B63;&#x80FD;&#x91CF;&#x7684;&#x4E1C;&#x897F;&#x5427;&#xFF0C;&#x6BD5;&#x7ADF;&#x597D;&#x51E0;&#x5929;&#x6CA1;&#x66F4;&#x4E86;&#xFF0C;&#x4E0D;&#x80FD;&#x4E00;&#x4E0A;&#x6765;&#x5C31;&#x7ED9;&#x5927;&#x5BB6;&#x6DFB;&#x5835;&#x3002;</p>
<h2 id="90-&#x7684;&#x7F5A;&#x7403;&#x547D;&#x4E2D;&#x7387;&#x600E;&#x6837;&#x70BC;&#x6210;&#x7684;"><a href="#90-&#x7684;&#x7F5A;&#x7403;&#x547D;&#x4E2D;&#x7387;&#x600E;&#x6837;&#x70BC;&#x6210;&#x7684;" class="headerlink" title="90%&#x7684;&#x7F5A;&#x7403;&#x547D;&#x4E2D;&#x7387;&#x600E;&#x6837;&#x70BC;&#x6210;&#x7684;"></a>90%&#x7684;&#x7F5A;&#x7403;&#x547D;&#x4E2D;&#x7387;&#x600E;&#x6837;&#x70BC;&#x6210;&#x7684;</h2><p>&#x4ECA;&#x5929;&#x4E0D;&#x77E5;&#x9053;&#x5728;&#x54EA;&#x513F;&#x770B;&#x5230;&#x7684;&#x65B0;&#x95FB;&#xFF0C;&#x5E93;&#x91CC;&#x7684;&#x5E38;&#x89C4;&#x8D5B;&#x7F5A;&#x7403;&#x547D;&#x4E2D;&#x7387;&#x5DF2;&#x7ECF;&#x8D85;&#x8D8A;&#x7EB3;&#x4EC0;&#x6392;&#x540D;NBA&#x5386;&#x53F2;&#x7B2C;&#x4E00;&#xFF0C;90%&#x7684;&#x7F5A;&#x7403;&#x547D;&#x4E2D;&#x7387;&#x662F;&#x4EC0;&#x4E48;&#x6982;&#x5FF5;&#xFF1F;&#x90A3;&#x53EF;&#x662F;&#x7F5A;&#x5341;&#x4E2A;&#x8FDB;&#x4E5D;&#x4E2A;&#x5440;&#xFF08;&#x8BF4;&#x4E86;&#x597D;&#x50CF;&#x7B49;&#x4E8E;&#x6CA1;&#x8BF4;&#xFF09;&#xFF0C;&#x5FC3;&#x60F3;&#x5E94;&#x8BE5;&#x662F;&#x5F88;&#x5389;&#x5BB3;&#x7684;&#x6C34;&#x51C6;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x4E0B;&#x5348;&#x4E5F;&#x53BB;&#x7403;&#x573A;&#x8BD5;&#x4E86;&#x8BD5;&#xFF0C;&#x55EF;&#xFF0C;&#x7F5A;&#x5341;&#x4E2A;&#xFF0C;&#x6211;&#x4E5F;&#x8FDB;&#x4E86;&#x4E5D;&#x4E2A;&#x561B;&#xFF01;&#x54C8;&#x54C8;&#x54C8;&#xFF0C;&#x6BD5;&#x7ADF;&#x81EA;&#x5DF1;&#x662F;&#x90A3;&#x79CD;&#x624B;&#x611F;&#x6765;&#x4E86;&#xFF0C;&#x8C01;&#x4E5F;&#x6321;&#x4E0D;&#x4F4F;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x56DE;&#x60F3;&#x8D77;&#x4ECE;&#x521D;&#x4E8C;&#x5F00;&#x59CB;&#x63A5;&#x89E6;&#x7BEE;&#x7403;&#xFF0C;&#x597D;&#x50CF;&#x4E00;&#x76F4;&#x90FD;&#x662F;&#x4EE5;&#x6295;&#x7BEE;&#x89C1;&#x957F;&#xFF0C;&#x6BCF;&#x6BCF;&#x5230;&#x7BEE;&#x7403;&#x573A;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x662F;&#x8054;&#x7CFB;&#x6295;&#x7BEE;&#x3002;&#x6240;&#x4EE5;&#x65E5;&#x79EF;&#x6708;&#x7D2F;&#xFF0C;&#x5BFC;&#x81F4;&#x5176;&#x4ED6;&#x57FA;&#x672C;&#x529F;&#x4E00;&#x584C;&#x7CCA;&#x6D82;&#xFF0C;&#x53EA;&#x5269;&#x4E0B;&#x6295;&#x7BEE;&#x8FD9;&#x4E00;&#x9879;&#x8FD8;&#x52C9;&#x5F3A;&#x53EF;&#x4EE5;&#x3002;&#x597D;&#x50CF;&#x8FD8;&#x8BB0;&#x5F97;&#x53BB;&#x5E74;&#x53C2;&#x52A0;&#x8FC7;&#x4E00;&#x9879;&#x8BA1;&#x65F6;&#x4E09;&#x5206;&#x7403;&#x5927;&#x8D5B;&#xFF0C;&#x4E00;&#x5206;&#x949F;25&#x4E2A;&#x7403;&#xFF0C;&#x597D;&#x50CF;&#x6295;&#x8FDB;&#x4E86;15&#x4E2A;&#x5DEE;&#x70B9;&#x8FDB;&#x51B3;&#x8D5B;&#xFF0C;&#x73B0;&#x5728;&#x60F3;&#x8D77;&#x6765;&#x597D;&#x50CF;&#x611F;&#x89C9;&#x8FD8;&#x662F;&#x7F8E;&#x7F8E;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x554A;&#xFF0C;&#x4E13;&#x6CE8;&#x4E8E;&#x6295;&#x7BEE;&#xFF0C;&#x9020;&#x5C31;&#x4E86;&#x6295;&#x624B;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x89D2;&#x8272;&#x3002;&#x7A81;&#x7136;&#x597D;&#x60F3;&#x518D;&#x548C;&#x5927;&#x5B66;&#x7684;&#x597D;&#x53CB;&#x5728;&#x76DB;&#x590F;&#x7684;&#x591C;&#x665A;&#x5728;&#x4E1C;&#x533A;&#x62B9;&#x9ED1;&#x5355;&#x6311;&#xFF0C;&#x597D;&#x60F3;&#x56DE;&#x5230;&#x5BB6;&#x548C;&#x597D;&#x670B;&#x53CB;&#x53BB;&#x6253;&#x9EBB;&#x5C06;&#xFF0C;&#x554A;&#x5478;&#xFF0C;&#x6253;&#x7BEE;&#x7403;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x7684;NBA&#xFF0C;&#x7A81;&#x7136;&#x6709;&#x4E00;&#x79CD;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x8BF4;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x4EE5;&#x524D;&#x5F88;&#x7A00;&#x6709;&#x7684;&#x4E09;&#x53CC;&#x611F;&#x89C9;&#x73B0;&#x5728;&#x4FE1;&#x624B;&#x62C8;&#x6765;&#xFF0C;&#x4EE5;&#x524D;&#x5F88;&#x5C11;&#x7684;40+&#x73B0;&#x5728;&#x611F;&#x89C9;&#x6BCF;&#x5929;&#x90FD;&#x6709;&#x3002;&#x65F6;&#x4EE3;&#x53D8;&#x4E86;&#xFF0C;&#x7BEE;&#x7403;&#x4E5F;&#x53D8;&#x4E86;&#xFF0C;&#x867D;&#x7136;&#x6CA1;&#x6709;&#x89C1;&#x8BC1;&#x897F;&#x79D1;&#x4E1C;&#x827E;&#xFF0C;&#x5317;&#x5361;&#x5357;&#x9EA6;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x8FD8;&#x662F;&#x6709;&#x5E78;&#x89C1;&#x8BC1;&#x4E86;&#x79D1;&#x6BD4;&#x548C;&#x9EA6;&#x8FEA;&#x7684;&#x6700;&#x540E;&#x65F6;&#x4EE3;&#x3002;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x5F88;&#x96BE;&#x5728;&#x770B;&#x5230;&#x90A3;&#x4E48;&#x98D8;&#x9038;&#x7684;&#x7403;&#x98CE;&#xFF0C;&#x518D;&#x96BE;&#x770B;&#x5230;&#x7F8E;&#x5982;&#x753B;&#x7684;&#x5E72;&#x62D4;&#x548C;&#x540E;&#x4EF0;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;NBA&#x91CC;&#x9762;&#x7684;&#x7403;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x53EA;&#x6709;&#x65E5;&#x590D;&#x4E00;&#x65E5;&#x7684;&#x6BD4;&#x8D5B;&#x3001;&#x8BAD;&#x7EC3;&#xFF0C;&#x624D;&#x53EF;&#x80FD;&#x6210;&#x4E3A;&#x5DE8;&#x661F;&#x95EA;&#x8000;&#x8D5B;&#x573A;&#xFF0C;&#x53EA;&#x6709;&#x4E13;&#x6CE8;&#x4E8E;&#x7BEE;&#x7403;&#xFF0C;&#x624D;&#x80FD;&#x5438;&#x5F15;&#x4E00;&#x4EE3;&#x53C8;&#x4E00;&#x4EE3;&#x7684;&#x5C0F;&#x5B69;&#x62B1;&#x8D77;&#x7BEE;&#x7403;&#x3001;&#x8D70;&#x5411;&#x7403;&#x573A;&#x3002;</p>
<h2 id="&#x4E00;&#x767E;&#x4E07;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x600E;&#x6837;&#x5199;&#x5B8C;&#x7684;"><a href="#&#x4E00;&#x767E;&#x4E07;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x600E;&#x6837;&#x5199;&#x5B8C;&#x7684;" class="headerlink" title="&#x4E00;&#x767E;&#x4E07;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x600E;&#x6837;&#x5199;&#x5B8C;&#x7684;"></a>&#x4E00;&#x767E;&#x4E07;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x600E;&#x6837;&#x5199;&#x5B8C;&#x7684;</h2><p>&#x5509;&#xFF0C;&#x5B9E;&#x5728;&#x4E0D;&#x77E5;&#x9053;&#x5199;&#x5565;&#x4E86;&#xFF0C;&#x968F;&#x4FBF;&#x8D77;&#x4E2A;&#x5C0F;&#x6807;&#x9898;&#x51D1;&#x51D1;&#x5B57;&#x6570;&#x3002;&#x611F;&#x89C9;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#x90FD;&#x4FE1;&#x5949;&#x8005;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x91CF;&#x53D8;&#x5F15;&#x8D77;&#x8D28;&#x53D8;&#x3002;&#x6DF1;&#x77E5;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#x5929;&#x624D;&#x5F88;&#x5C11;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x90FD;&#x662F;&#x666E;&#x901A;&#x4EBA;&#xFF0C;&#x5305;&#x62EC;&#x6211;&#x81EA;&#x5DF1;&#xFF0C;&#x8981;&#x60F3;&#x8FFD;&#x8D76;&#x5929;&#x624D;&#xFF0C;&#x53EA;&#x6709;&#x6BD4;&#x4ED6;&#x4EEC;&#x4ED8;&#x51FA;&#x66F4;&#x591A;&#x52AA;&#x529B;&#x3002;&#x6240;&#x4EE5;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#xFF0C;&#x4E00;&#x76F4;&#x90FD;&#x662F;&#x9760;&#x5237;&#x6210;&#x957F;&#x3002;&#x4E00;&#x5F00;&#x59CB;&#x4E0D;&#x4F1A;&#x82F1;&#x8BED;&#xFF0C;&#x6284;&#x5199;&#x5355;&#x8BCD;&#x7684;&#x65F6;&#x5019;&#x522B;&#x4EBA;&#x6284;&#x4E00;&#x904D;&#xFF0C;&#x6211;&#x6284;&#x4E24;&#x8FB9;&#xFF0C;&#x522B;&#x4EBA;&#x505A;&#x4E00;&#x672C;&#x4E60;&#x9898;&#x96C6;&#xFF0C;&#x6211;&#x505A;&#x4E24;&#x672C;&#x751A;&#x81F3;&#x66F4;&#x591A;&#x3002;&#x522B;&#x4EBA;&#x5199;&#x4E00;&#x767E;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x6211;&#x5199;&#x4E00;&#x5343;&#x884C;&#x3002;&#x8BF6;&#xFF0C;&#x597D;&#x50CF;&#x6709;&#x70B9;&#x5938;&#x5F20;&#x8FC7;&#x5934;&#x4E86;&#xFF0C;o(&#x256F;&#x25A1;&#x2570;)o&#x3002;</p>
<p>&#x4E5F;&#x6CA1;&#x6709;&#x7EDF;&#x8BA1;&#x5230;&#x73B0;&#x5728;&#x4E3A;&#x6B62;&#xFF0C;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x5199;&#x8FC7;&#x591A;&#x5C11;&#x4EE3;&#x7801;&#x4E86;&#xFF0C;&#x4E00;&#x767E;&#x4E07;&#x884C;&#x4E5F;&#x8BB8;&#x662F;&#x4E2A;&#x865A;&#x6570;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x81EA;&#x5DF1;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x6709;&#x5199;&#x5230;&#x4E00;&#x767E;&#x4E07;&#x884C;&#x3002;&#x4ECE;&#x81EA;&#x8EAB;&#x6765;&#x770B;&#xFF0C;&#x591A;&#x5199;&#x4EE3;&#x7801;&#x786E;&#x5B9E;&#x4F1A;&#x6210;&#x957F;&#xFF0C;&#x8BB0;&#x5F97;&#x4E00;&#x5F00;&#x59CB;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#x662F;&#x79BB;&#x4E0D;&#x5F00;&#x4E66;&#x672C;&#xFF0C;&#x79BB;&#x4E0D;&#x5F00;&#x7F51;&#x7EDC;&#x7684;&#xFF0C;&#x5199;&#x7740;&#x5199;&#x7740;&#xFF0C;&#x6709;&#x4E00;&#x5929;&#x7A81;&#x7136;&#x53D1;&#x73B0;&#xFF0C;&#x4E0D;&#x7528;&#x4E0A;&#x7F51;&#x5176;&#x5B9E;&#x4E5F;&#x53EF;&#x4EE5;&#x628A;&#x4EE3;&#x7801;&#x5199;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x719F;&#x7EC3;&#x5EA6;&#x5427;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x8FD9;&#x51E0;&#x5E74;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x4E13;&#x6CE8;&#x4E8E;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4EE3;&#x7801;&#x7684;&#x638C;&#x63E1;&#x5EA6;&#x4E5F;&#x8FD8;&#x7B97;&#x52C9;&#x5F3A;&#x53EF;&#x4EE5;&#xFF0C;&#x4E09;&#x4E24;&#x4E2A;&#x5C0F;&#x65F6;&#x5199;&#x4E2A;&#x7B80;&#x5355;&#x7684;App&#x6216;&#x8005;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;&#x867D;&#x7136;&#x81EA;&#x5DF1;&#x662F;&#x5B66;&#x901A;&#x4FE1;&#x7684;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x901A;&#x4FE1;&#x77E5;&#x8BC6;&#x4E86;&#x89E3;&#x7684;&#x5374;&#x5C11;&#x5F97;&#x53EF;&#x601C;&#xFF0C;&#x6240;&#x4EE5;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#xFF0C;&#x4E00;&#x5B9A;&#x4E0D;&#x8981;&#x4E24;&#x5929;&#x6253;&#x6E14;&#x4E09;&#x5929;&#x6652;&#x7F51;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x4E13;&#x6CE8;&#x5730;&#x8D70;&#x4E0B;&#x53BB;&#xFF0C;&#x4E0D;&#x7136;&#x6709;&#x53EF;&#x80FD;&#x6700;&#x540E;&#x5565;&#x4E5F;&#x635E;&#x4E0D;&#x7740;&#x3002;</p>
<h2 id="&#x628A;&#x81EA;&#x5DF1;&#x5173;&#x5728;&#x5C0F;&#x9ED1;&#x5C4B;&#x662F;&#x4EC0;&#x4E48;&#x4F53;&#x9A8C;"><a href="#&#x628A;&#x81EA;&#x5DF1;&#x5173;&#x5728;&#x5C0F;&#x9ED1;&#x5C4B;&#x662F;&#x4EC0;&#x4E48;&#x4F53;&#x9A8C;" class="headerlink" title="&#x628A;&#x81EA;&#x5DF1;&#x5173;&#x5728;&#x5C0F;&#x9ED1;&#x5C4B;&#x662F;&#x4EC0;&#x4E48;&#x4F53;&#x9A8C;"></a>&#x628A;&#x81EA;&#x5DF1;&#x5173;&#x5728;&#x5C0F;&#x9ED1;&#x5C4B;&#x662F;&#x4EC0;&#x4E48;&#x4F53;&#x9A8C;</h2><p>&#x4E0D;&#x8FC7;&#x554A;&#xFF0C;&#x4EBA;&#x6BD5;&#x7ADF;&#x5F97;&#x9762;&#x5BF9;&#x73B0;&#x5B9E;&#xFF0C;&#x8981;&#x6BD5;&#x4E1A;&#x5C31;&#x8981;&#x5199;&#x8BBA;&#x6587;&#xFF0C;&#x8981;&#x5199;&#x8BBA;&#x6587;&#xFF0C;&#x5C31;&#x8981;&#x628A;&#x81EA;&#x5DF1;&#x5173;&#x5728;&#x5C0F;&#x9ED1;&#x5C4B;&#xFF0C;&#x54A6;&#xFF0C;&#x8FD9;&#x4E2A;&#x903B;&#x8F91;&#x597D;&#x50CF;&#x4E0D;&#x5BF9;&#x3002;&#x54C8;&#x54C8;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x5E76;&#x4E0D;&#x662F;&#x6211;&#xFF0C;&#x800C;&#x662F;&#x81EA;&#x5DF1;&#x633A;&#x4F69;&#x670D;&#x7684;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#xFF0C;&#x611F;&#x89C9;&#x538B;&#x529B;&#x9AA4;&#x589E;&#x3002;&#x7814;&#x4E00;&#x7684;&#x65F6;&#x5019;&#x4E0A;&#x4E0A;&#x8BFE;&#xFF0C;&#x505A;&#x505A;&#x9879;&#x76EE;&#xFF0C;&#x518D;&#x5212;&#x5212;&#x6C34;&#xFF0C;&#x65F6;&#x95F4;&#x5C31;&#x8FD9;&#x6837;&#x8FC7;&#x4E86;&#xFF0C;&#x90A3;&#x65F6;&#x5019;&#x57FA;&#x672C;&#x65E0;&#x5FE7;&#x65E0;&#x8651;&#x3002;&#x7136;&#x800C;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#xFF0C;&#x8F6C;&#x773C;&#x5C31;&#x5230;&#x4E86;&#x8981;&#x5199;&#x5C0F;&#x8BBA;&#x6587;&#xFF0C;&#x8981;&#x5F00;&#x59CB;&#x627E;&#x5B9E;&#x4E60;&#xFF0C;&#x627E;&#x5DE5;&#x4F5C;&#xFF0C;&#x518D;&#x7136;&#x540E;&#x5C31;&#x8981;&#x51C6;&#x5907;&#x6BD5;&#x4E1A;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#xFF0C;&#x62C5;&#x5B50;&#x7A81;&#x7136;&#x91CD;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x538B;&#x529B;&#x4E5F;&#x7A81;&#x7136;&#x591A;&#x4E86;&#x597D;&#x591A;&#x3002;&#x5C24;&#x5176;&#x662F;&#x5728;&#x4E0D;&#x64C5;&#x957F;&#x5199;&#x8BBA;&#x6587;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4EE5;&#x53CA;&#x627E;&#x5B9E;&#x4E60;&#x627E;&#x5DE5;&#x4F5C;&#x89C9;&#x5F97;&#x8FD8;&#x6CA1;&#x6709;&#x5341;&#x8DB3;&#x628A;&#x63E1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7A81;&#x7136;&#x6709;&#x70B9;&#x751F;&#x65E0;&#x53EF;&#x604B;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x65F6;&#x5019;&#x554A;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x5173;&#x5728;&#x5C0F;&#x9ED1;&#x5C4B;&#x91CC;&#x9762;&#xFF0C;&#x4E13;&#x6CE8;&#x4E8E;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x6709;&#x8BA1;&#x5212;&#x5730;&#x5B8C;&#x6210;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x5E94;&#x8BE5;&#x4F1A;&#x597D;&#x5F88;&#x591A;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x554A;&#xFF0C;&#x7ED9;&#x81EA;&#x5DF1;&#x7ACB;&#x4E00;&#x4E2A;flag&#xFF0C;&#x5728;&#x56DE;&#x5BB6;&#x524D;&#x628A;&#x8BBA;&#x6587;&#x7684;idea&#x6574;&#x7406;&#x6E05;&#x695A;&#xFF0C;&#x8DD1;&#x51FA;&#x4E00;&#x4E9B;&#x5BF9;&#x6BD4;&#x4EFF;&#x771F;&#xFF0C;&#x7136;&#x540E;&#x4E09;&#x6708;&#x4EFD;&#x7684;&#x6837;&#x5B50;&#x628A;&#x8BBA;&#x6587;&#x641E;&#x5B9A;&#xFF0C;&#x7136;&#x540E;&#x5F00;&#x59CB;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x7684;Coding&#x6C34;&#x5E73;&#xFF0C;&#x4E89;&#x53D6;&#x627E;&#x5230;&#x4E00;&#x4EFD;&#x597D;&#x7684;&#x5B9E;&#x4E60;&#x3002;&#x4E5F;&#x5B66;&#x524D;&#x8F88;&#x4E00;&#x6837;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x5173;&#x5728;&#x5C0F;&#x9ED1;&#x5C4B;&#x91CC;&#x9762;&#xFF0C;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x6765;&#x5B8C;&#x6210;&#x8BA1;&#x5212;&#xFF0C;&#x4F53;&#x9A8C;&#x4E00;&#x4E0B;&#x628A;&#x81EA;&#x5DF1;&#x5173;&#x5728;&#x5C0F;&#x9ED1;&#x5C4B;&#x91CC;&#x9762;&#x4F1A;&#x662F;&#x4E00;&#x79CD;&#x600E;&#x6837;&#x795E;&#x5947;&#x7684;&#x4F53;&#x9A8C;&#x3002;</p>
<h2 id="&#x7231;&#x4E00;&#x4EBA;&#xFF0C;&#x62E9;&#x4E00;&#x4E8B;&#xFF0C;&#x7EC8;&#x4E00;&#x751F;"><a href="#&#x7231;&#x4E00;&#x4EBA;&#xFF0C;&#x62E9;&#x4E00;&#x4E8B;&#xFF0C;&#x7EC8;&#x4E00;&#x751F;" class="headerlink" title="&#x7231;&#x4E00;&#x4EBA;&#xFF0C;&#x62E9;&#x4E00;&#x4E8B;&#xFF0C;&#x7EC8;&#x4E00;&#x751F;"></a>&#x7231;&#x4E00;&#x4EBA;&#xFF0C;&#x62E9;&#x4E00;&#x4E8B;&#xFF0C;&#x7EC8;&#x4E00;&#x751F;</h2><p>&#x80FD;&#x770B;&#x5230;&#x8FD9;&#x91CC;&#x7684;&#x90FD;&#x662F;&#x771F;&#x7231;&#x554A;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x8111;&#x6D77;&#x4E2D;&#x4E3A;&#x5565;&#x7A81;&#x7136;&#x6D6E;&#x73B0;&#x51FA;&#x8FD9;&#x4E2A;&#x6807;&#x9898;&#x3002;&#x4EBA;&#x53EA;&#x80FD;&#x4E13;&#x6CE8;&#x4E8E;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x662F;&#x77ED;&#x671F;&#x76EE;&#x6807;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x957F;&#x671F;&#x7684;&#x5B8F;&#x4F1F;&#x76EE;&#x6807;&#x3002;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x65E5;&#x5B50;&#x91CC;&#x9762;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x771F;&#x7684;&#x80FD;&#x505A;&#x5230;&#x4E13;&#x6CE8;&#x4E8E;&#x4E00;&#x4EF6;&#x4E8B;&#x3002;&#x827E;&#x739B;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x53BB;&#x5C55;&#x5F00;&#x8FD9;&#x4E2A;&#x6807;&#x9898;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x6BB5;&#x5C31;&#x5230;&#x6B64;&#x4E3A;&#x6B62;&#xFF0C;&#x5927;&#x5BB6;&#x81EA;&#x884C;&#x8111;&#x8865;&#x5427;&#x3002;</p>
<p>&#x7231;&#x4E00;&#x4EBA;&#xFF0C;&#x62E9;&#x4E00;&#x4E8B;&#xFF0C;&#x7EC8;&#x4E00;&#x751F;&#xFF0C;&#x8FD9;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x79CD;&#x751F;&#x6D3B;&#x6001;&#x5EA6;&#x3002;</p>
<p>&#x4E4B;&#x524D;&#x7684;&#x6280;&#x672F;&#x6587;&#x7AE0;&#x597D;&#x50CF;&#x597D;&#x591A;&#x4EBA;&#x90FD;&#x770B;&#x4E0D;&#x61C2;&#xFF0C;&#x6240;&#x4EE5;&#x5148;&#x968F;&#x4FBF;&#x778E;&#x5199;&#x5199;&#x3002;&#x96BE;&#x5F97;&#x5199;&#x4E00;&#x6B21;&#x9E21;&#x6C64;&#x6587;&#xFF0C;&#x5E76;&#x4E14;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x60C5;&#x5546;&#x4F4E;&#x8FD9;&#x662F;&#x516C;&#x8BA4;&#x7684;&#x4E8B;&#x5B9E;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x7897;&#x6C64;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x7897;&#x6BD2;&#x6C64;&#xFF0C;&#x6240;&#x4EE5;&#x559D;&#x6C64;&#x8981;&#x8C28;&#x614E;&#xFF0C;&#x5C0F;&#x5FC3;&#x4E2D;&#x6BD2;&#x8EAB;&#x4EA1;&#xFF0C;&#x54C8;&#x54C8;&#x54C8;&#x3002;</p>

          
        
      
    </div>
    
    <div>
      
    </div>

    <div>
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2016/12/30/有些事只有勇敢地去做了才知道结果会怎样/" itemprop="url">
                  有些事只有勇敢地去做了才知道结果会怎样
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">Posted on</span>
            <time itemprop="dateCreated" datetime="2016-12-30T00:39:23+08:00" content="2016-12-30">
              2016-12-30
            </time>
          </span>

          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/12/30/有些事只有勇敢地去做了才知道结果会怎样/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/12/30/有些事只有勇敢地去做了才知道结果会怎样/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          <p>&#x6709;&#x4E9B;&#x4E8B;&#xFF0C;&#x53EA;&#x6709;&#x53BB;&#x505A;&#x4E86;&#x624D;&#x77E5;&#x9053;&#x7ED3;&#x679C;&#x4F1A;&#x6F14;&#x53D8;&#x6210;&#x600E;&#x6837;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x597D;&#x7684;&#x8FD8;&#x662F;&#x574F;&#x7684;&#x3002;&#x6709;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x53EA;&#x6709;&#x7EC6;&#x5FC3;&#x53BB;&#x770B;&#x4E86;&#xFF0C;&#x624D;&#x77E5;&#x9053;&#xFF0C;&#x54E6;&#xFF0C;&#x539F;&#x6765;&#x662F;&#x8FD9;&#x6837;&#x554A;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x5199;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x539F;&#x6765;&#x81EA;&#x5DF1;&#x4E5F;&#x53EF;&#x5F53;&#x6807;&#x9898;&#x515A;&#x3002;&#x54C8;&#x54C8;&#x54C8;&#xFF0C;&#x5F00;&#x4E2A;&#x73A9;&#x7B11;&#xFF0C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x8FD8;&#x662F;&#x6709;&#x70B9;&#x4E1C;&#x897F;&#x7684;&#xFF0C;&#x8BF7;&#x6162;&#x6162;&#x770B;&#x3002;</p>
          <div class="post-more-link text-center">
            <a class="btn" href="/2016/12/30/有些事只有勇敢地去做了才知道结果会怎样/#more" rel="contents">
              Read more &raquo;
            </a>
          </div>
        
      
    </div>
    
    <div>
      
    </div>

    <div>
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2016/12/25/设计模式之享元模式/" itemprop="url">
                  设计模式之享元模式
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">Posted on</span>
            <time itemprop="dateCreated" datetime="2016-12-25T22:07:55+08:00" content="2016-12-25">
              2016-12-25
            </time>
          </span>

          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/12/25/设计模式之享元模式/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/12/25/设计模式之享元模式/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          <p>&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x7ECF;&#x5178;&#x7684;web&#x9879;&#x76EE;&#x6765;&#x8BF4;&#xFF0C;&#x63A7;&#x5236;&#x5668;+&#x7F13;&#x5B58;+&#x6570;&#x636E;&#x5E93;&#x662F;&#x4E00;&#x79CD;&#x7ECF;&#x5178;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x7F13;&#x5B58;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x7F13;&#x89E3;&#x9AD8;&#x5E76;&#x53D1;&#x60C5;&#x51B5;&#x4E0B;&#x6570;&#x636E;&#x5E93;&#x67E5;&#x8BE2;&#x8017;&#x65F6;&#x95EE;&#x9898;&#x3002;&#x5C31;&#x62FF;&#x6700;&#x8FD1;&#x7684;&#x6625;&#x8FD0;&#x6765;&#x8BF4;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x80AF;&#x5B9A;&#x662F;&#x901A;&#x8FC7;&#x7F13;&#x5B58;&#x7684;&#x65B9;&#x5F0F;&#x5FEB;&#x901F;&#x54CD;&#x5E94;&#xFF0C;&#x907F;&#x514D;&#x9AD8;&#x5E76;&#x53D1;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x670D;&#x52A1;&#x8D85;&#x65F6;&#x3002;&#x5728;Android&#x4E2D;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x8981;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4F1A;&#x901A;&#x8FC7;&#x6784;&#x9020;&#x51FD;&#x6570;&#x53BB;new&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x51FA;&#x6765;&#xFF0C;&#x8BD5;&#x60F3;&#x5982;&#x679C;&#x5728;&#x9AD8;&#x5E76;&#x53D1;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4EA7;&#x751F;&#x5927;&#x91CF;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x7528;&#x5B8C;&#x4E4B;&#x540E;&#x5783;&#x573E;&#x56DE;&#x6536;&#x4F1A;&#x975E;&#x5E38;&#x6D88;&#x8017;&#x8D44;&#x6E90;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4E5F;&#x9700;&#x8981;&#x5229;&#x7528;&#x7F13;&#x5B58;&#x8FD9;&#x79CD;&#x6982;&#x5FF5;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x79F0;&#x4E4B;&#x4E3A;&#x4EAB;&#x5143;&#x6A21;&#x5F0F;&#x3002;</p>
          <div class="post-more-link text-center">
            <a class="btn" href="/2016/12/25/设计模式之享元模式/#more" rel="contents">
              Read more &raquo;
            </a>
          </div>
        
      
    </div>
    
    <div>
      
    </div>

    <div>
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2016/12/12/拆轮子系列之拆OkHttp/" itemprop="url">
                  拆轮子系列之拆OkHttp
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">Posted on</span>
            <time itemprop="dateCreated" datetime="2016-12-12T16:23:48+08:00" content="2016-12-12">
              2016-12-12
            </time>
          </span>

          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/12/12/拆轮子系列之拆OkHttp/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/12/12/拆轮子系列之拆OkHttp/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          <p>&#x4FD7;&#x8BDD;&#x8BF4;&#x9020;&#x8F6E;&#x5B50;&#x4E0D;&#x5982;&#x62C6;&#x8F6E;&#x5B50;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x524D;&#x63D0;&#x662F;&#x8FD9;&#x8F6E;&#x5B50;&#x8DB3;&#x591F;&#x597D;&#xFF0C;&#x5F53;&#x7136;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x5C31;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#x8FD8;&#x4E0D;&#x8DB3;&#x4EE5;&#x9020;&#x51FA;&#x4F18;&#x79C0;&#x7684;&#x8F6E;&#x5B50;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5C31;&#x5148;&#x4ECE;&#x62C6;&#x8F6E;&#x5B50;&#x5F00;&#x59CB;&#x63D0;&#x9AD8;&#x80FD;&#x529B;&#x5427;&#x3002;OkHttp&#x662F;&#x516C;&#x8BA4;&#x7684;&#x4F18;&#x79C0;&#x7F51;&#x7EDC;&#x5E93;&#xFF0C;&#x5341;&#x4E2A;&#x5F00;&#x53D1;&#x8005;&#x4F30;&#x8BA1;&#x4E5D;&#x4E2A;&#x90FD;&#x4F1A;&#x7528;&#x5B83;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x7531;&#x4E8E;&#x5728;&#x5F00;&#x53D1;&#x5355;&#x673A;&#x5E94;&#x7528;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x7528;&#x5B83;&#x3002;&#x54C8;&#x54C8;&#xFF0C;just kidding&#x3002;&#x73B0;&#x5728;&#x5C31;&#x6765;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x62C6;&#x5427;&#x3002;</p>
          <div class="post-more-link text-center">
            <a class="btn" href="/2016/12/12/拆轮子系列之拆OkHttp/#more" rel="contents">
              Read more &raquo;
            </a>
          </div>
        
      
    </div>
    
    <div>
      
    </div>

    <div>
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2016/11/29/RecyclerView Adapter一次简单的重构/" itemprop="url">
                  RecyclerView Adapter一次简单的重构
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">Posted on</span>
            <time itemprop="dateCreated" datetime="2016-11-29T15:32:38+08:00" content="2016-11-29">
              2016-11-29
            </time>
          </span>

          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/11/29/RecyclerView Adapter一次简单的重构/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/11/29/RecyclerView Adapter一次简单的重构/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          <p>RecyclerView&#x4E0D;&#x7528;&#x591A;&#x8BB2;&#xFF0C;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x5F88;&#x5C11;&#x7528;ListView&#x4E86;&#xFF0C;&#x5927;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x4F7F;&#x7528;RecyclerView&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;RecyclerView&#x5728;&#x8BBE;&#x8BA1;&#x4E0A;&#x5DF2;&#x7ECF;&#x5E2E;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x4E86;&#x590D;&#x7528;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4E0D;&#x7528;&#x518D;&#x8FC7;&#x591A;&#x8003;&#x8651;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x3002;&#x5E76;&#x4E14;&#x5229;&#x7528;RecyclerView&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x5730;&#x8BBE;&#x8BA1;&#x5404;&#x79CD;&#x5217;&#x8868;&#x754C;&#x9762;&#x4EE5;&#x53CA;&#x7011;&#x5E03;&#x6D41;&#x7B49;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x518D;&#x8BE6;&#x8FF0;&#x3002;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E3B;&#x8981;&#x8BB2;&#x8BB2;&#x4E00;&#x6B21;&#x7B80;&#x5355;&#x7684;RecyclerView Adapter&#x91CD;&#x6784;&#x95EE;&#x9898;&#x3002;</p>
          <div class="post-more-link text-center">
            <a class="btn" href="/2016/11/29/RecyclerView Adapter一次简单的重构/#more" rel="contents">
              Read more &raquo;
            </a>
          </div>
        
      
    </div>
    
    <div>
      
    </div>

    <div>
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2016/11/28/Jenkins+gradle+git的Android持续集成入门/" itemprop="url">
                  Jenkins+gradle+git的Android持续集成入门
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">Posted on</span>
            <time itemprop="dateCreated" datetime="2016-11-28T23:09:45+08:00" content="2016-11-28">
              2016-11-28
            </time>
          </span>

          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/11/28/Jenkins+gradle+git的Android持续集成入门/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/11/28/Jenkins+gradle+git的Android持续集成入门/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          <p>&#x672C;&#x7740;&#x5411;&#x5168;&#x6808;&#x5DE5;&#x7A0B;&#x5E08;&#x53D1;&#x5C55;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x9664;&#x4E86;&#x8981;&#x597D;&#x597D;&#x641E;Android&#x4E4B;&#x5916;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x4E5F;&#x8981;&#x7A0D;&#x5FAE;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#xFF0C;&#x6240;&#x4EE5;&#x62BD;&#x4E86;&#x70B9;&#x5C0F;&#x65F6;&#x95F4;&#x6363;&#x9F13;&#x6363;&#x9F13;&#x4E86;&#x4E00;&#x4E0B;Jenkins&#x7684;&#x6301;&#x7EED;&#x96C6;&#x6210;&#x3002;</p>
          <div class="post-more-link text-center">
            <a class="btn" href="/2016/11/28/Jenkins+gradle+git的Android持续集成入门/#more" rel="contents">
              Read more &raquo;
            </a>
          </div>
        
      
    </div>
    
    <div>
      
    </div>

    <div>
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2016/11/23/Xposed入门实践/" itemprop="url">
                  Xposed入门实践
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">Posted on</span>
            <time itemprop="dateCreated" datetime="2016-11-23T12:49:42+08:00" content="2016-11-23">
              2016-11-23
            </time>
          </span>

          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/11/23/Xposed入门实践/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/11/23/Xposed入门实践/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          <p>&#x6700;&#x8FD1;&#x5728;&#x770B;Android&#x7CFB;&#x7EDF;&#x5C42;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x7A81;&#x7136;&#x60F3;&#x8D77;&#x4E86;&#x4E4B;&#x524D;&#x5237;&#x673A;&#x65F6;&#x7ECF;&#x5E38;&#x73A9;&#x7684;Xposed&#x6846;&#x67B6;&#xFF0C;&#x5FC3;&#x8840;&#x6765;&#x6F6E;&#x60F3;&#x8981;&#x81EA;&#x5DF1;&#x8BD5;&#x4E00;&#x8BD5;Xposed&#x6A21;&#x5757;&#x5F00;&#x53D1;&#xFF0C;&#x7136;&#x540E;&#x67E5;&#x9605;&#x4E86;&#x4E00;&#x4E9B;&#x8D44;&#x6599;&#xFF0C;&#x4E0A;&#x624B;&#x8BD5;&#x4E86;&#x8BD5;&#xFF0C;&#x7B80;&#x7B54;&#x505A;&#x4E00;&#x4E0B;&#x603B;&#x7ED3;&#x3002;</p>
          <div class="post-more-link text-center">
            <a class="btn" href="/2016/11/23/Xposed入门实践/#more" rel="contents">
              Read more &raquo;
            </a>
          </div>
        
      
    </div>
    
    <div>
      
    </div>

    <div>
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2016/10/25/记一次与Android Notification的邂逅/" itemprop="url">
                  记一次与Android Notification的邂逅
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">Posted on</span>
            <time itemprop="dateCreated" datetime="2016-10-25T23:47:55+08:00" content="2016-10-25">
              2016-10-25
            </time>
          </span>

          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/10/25/记一次与Android Notification的邂逅/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/10/25/记一次与Android Notification的邂逅/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          <p>&#x9879;&#x76EE;&#x4E2D;&#x6700;&#x8FD1;&#x505A;&#x5230;&#x4E86;&#x804A;&#x5929;&#x529F;&#x80FD;&#xFF0C;&#x90A3;&#x4E48;&#x6D88;&#x606F;&#x901A;&#x77E5;&#x529F;&#x80FD;&#x662F;&#x9003;&#x4E0D;&#x6389;&#x7684;&#xFF0C;&#x5F53;&#x6709;&#x65B0;&#x7684;&#x6D88;&#x606F;&#x5230;&#x8FBE;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x7A0B;&#x5E8F;&#x80FD;&#x591F;&#x901A;&#x77E5;&#x7528;&#x6237;&#x6709;&#x65B0;&#x6D88;&#x606F;&#x5230;&#x8FBE;&#x3002;&#x5728;Android&#x4E2D;&#xFF0C;&#x6D88;&#x606F;&#x901A;&#x77E5;&#x8FD9;&#x4E00;&#x529F;&#x80FD;&#x4E3B;&#x8981;&#x7531;Notification&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x6839;&#x636E;Google&#x7684;&#x5B98;&#x65B9;&#x89E3;&#x91CA;&#xFF0C;Notification&#x662F;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x5E94;&#x7528;&#x7684;&#x5E38;&#x89C4; UI &#x5916;&#x90E8;&#x5411;&#x7528;&#x6237;&#x663E;&#x793A;&#x7684;&#x6D88;&#x606F;&#x3002;&#x5F53;&#x60A8;&#x544A;&#x77E5;&#x7CFB;&#x7EDF;&#x53D1;&#x51FA;&#x901A;&#x77E5;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x5148;&#x4EE5;&#x56FE;&#x6807;&#x7684;&#x5F62;&#x5F0F;&#x663E;&#x793A;&#x5728;&#x901A;&#x77E5;&#x533A;&#x57DF;&#x4E2D;&#x3002;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x6253;&#x5F00;&#x62BD;&#x5C49;&#x5F0F;&#x901A;&#x77E5;&#x680F;&#x67E5;&#x770B;&#x901A;&#x77E5;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x3002; &#x901A;&#x77E5;&#x533A;&#x57DF;&#x548C;&#x62BD;&#x5C49;&#x5F0F;&#x901A;&#x77E5;&#x680F;&#x5747;&#x662F;&#x7531;&#x7CFB;&#x7EDF;&#x63A7;&#x5236;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x67E5;&#x770B;&#x3002;</p>
          <div class="post-more-link text-center">
            <a class="btn" href="/2016/10/25/记一次与Android Notification的邂逅/#more" rel="contents">
              Read more &raquo;
            </a>
          </div>
        
      
    </div>
    
    <div>
      
    </div>

    <div>
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2016/10/20/Java 类初始化顺序/" itemprop="url">
                  Java 类初始化顺序
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">Posted on</span>
            <time itemprop="dateCreated" datetime="2016-10-20T23:54:18+08:00" content="2016-10-20">
              2016-10-20
            </time>
          </span>

          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/10/20/Java 类初始化顺序/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/10/20/Java 类初始化顺序/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          <p>&#x5BF9;&#x4E8E;&#x4E00;&#x95E8;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x7684;&#x8BED;&#x8A00;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x5FC5;&#x8981;&#x6E05;&#x695A;Java&#x7684;&#x7C7B;&#x7684;&#x521D;&#x59CB;&#x5316;&#x987A;&#x5E8F;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x4E86;&#x89E3;&#x8FD9;&#x4E2A;&#x987A;&#x5E8F;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x53EF;&#x80FD;&#x5728;&#x521D;&#x59CB;&#x5316;&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x5019;&#x72AF;&#x4E00;&#x4E9B;&#x81F4;&#x547D;&#x6027;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4E9B;&#x9519;&#x8BEF;&#x5F88;&#x96BE;&#x67E5;&#x627E;&#x51FA;&#x6765;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;Java&#x7C7B;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x5143;&#x7D20;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x5C5E;&#x6027;&#x3001;&#x65B9;&#x6CD5;&#x3001;&#x521D;&#x59CB;&#x5316;&#x4EE3;&#x7801;&#x5757;&#x3001;&#x5185;&#x90E8;&#x7C7B;&#x56DB;&#x79CD;&#xFF0C;&#x8FD9;&#x91CC;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E5F;&#x7B97;&#x662F;&#x65B9;&#x6CD5;&#x8303;&#x7574;&#x3002;&#x90A3;&#x4E48;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;Java&#x7C7B;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x56DB;&#x79CD;&#x5143;&#x7D20;&#x7684;&#x521D;&#x59CB;&#x5316;&#x987A;&#x5E8F;&#x662F;&#x600E;&#x6837;&#x7684;&#x5462;&#xFF1F;&#x9605;&#x8BFB;&#x5B8C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x4E5F;&#x8BB8;&#x4F60;&#x5E94;&#x8BE5;&#x5C31;&#x660E;&#x767D;&#x4E86;&#x3002;</p>
          <div class="post-more-link text-center">
            <a class="btn" href="/2016/10/20/Java 类初始化顺序/#more" rel="contents">
              Read more &raquo;
            </a>
          </div>
        
      
    </div>
    
    <div>
      
    </div>

    <div>
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2016/10/11/设计模式之独爱第三者迭代器模式/" itemprop="url">
                  设计模式之独爱第三者迭代器Iterator
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">Posted on</span>
            <time itemprop="dateCreated" datetime="2016-10-11T16:17:05+08:00" content="2016-10-11">
              2016-10-11
            </time>
          </span>

          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/10/11/设计模式之独爱第三者迭代器模式/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/10/11/设计模式之独爱第三者迭代器模式/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          <p>&#x5728;Java&#xFF0C;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x96C6;&#x5408;&#x7684;&#x904D;&#x5386;&#x603B;&#x662F;&#x4F1A;&#x7ECF;&#x5E38;&#x8981;&#x7528;&#x5230;&#xFF0C;&#x5728;&#x5B66;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5F80;&#x5F80;&#x4F1A;&#x81EA;&#x5DF1;&#x53BB;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x904D;&#x5386;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F46;&#x5728;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x5E0C;&#x671B;&#x96C6;&#x5408;&#x4EC5;&#x4EC5;&#x7EF4;&#x62A4;&#x81EA;&#x5DF1;&#x7684;&#x6570;&#x636E;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x904D;&#x5386;&#x64CD;&#x4F5C;&#x5E94;&#x8BE5;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x3002;&#x6240;&#x4EE5;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x7531;&#x5BA2;&#x6237;&#x7AEF;&#x81EA;&#x5DF1;&#x5199;&#x4E00;&#x6BB5;&#x904D;&#x5386;&#x4EE3;&#x7801;&#x53BB;&#x904D;&#x5386;&#x96C6;&#x5408;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x800C;&#x5F53;&#x5F88;&#x591A;&#x96C6;&#x5408;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x904D;&#x5386;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x4E00;&#x904D;&#x53C8;&#x4E00;&#x904D;&#x5730;&#x91CD;&#x590D;&#x7740;for&#x5FAA;&#x73AF;&#xFF0C;&#x8FD9;&#x80AF;&#x5B9A;&#x662F;&#x65E0;&#x6CD5;&#x8BA9;&#x4EBA;&#x63A5;&#x53D7;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5927;&#x7231;&#x7684;&#x7B2C;&#x4E09;&#x8005;&#x8FED;&#x4EE3;&#x5668;&#x8BDE;&#x751F;&#x4E86;&#x3002;</p>
          <div class="post-more-link text-center">
            <a class="btn" href="/2016/10/11/设计模式之独爱第三者迭代器模式/#more" rel="contents">
              Read more &raquo;
            </a>
          </div>
        
      
    </div>
    
    <div>
      
    </div>

    <div>
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
  </section>

  
  <nav class="pagination">
    <span class="page-number current">1</span><a class="page-number" href="/page/2/">2</a><a class="page-number" href="/page/3/">3</a><a class="extend next" rel="next" href="/page/2/"><i class="fa fa-angle-right"></i></a>
  </nav>



          </div>
          


          

        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <section class="site-overview sidebar-panel  sidebar-panel-active ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/uploads/avatar.png"
               alt="zhuimengfb" />
          <p class="site-author-name" itemprop="name">zhuimengfb</p>
          <p class="site-description motion-element" itemprop="description">persuing happiness</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">23</span>
              <span class="site-state-item-name">posts</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">5</span>
                <span class="site-state-item-name">tags</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">zhuimengfb</span>
</div>

<div class="powered-by">
  Powered by <a class="theme-link" href="http://hexo.io">Hexo</a>
</div>

<div class="theme-info">
  Theme -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  

  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"zhuimengfbblog"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  
  

  

  

</body>
</html>
