<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  




<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="有意思的东西," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x4E00;&amp;#x4E2A;&amp;#x65B0;&amp;#x5E74;&amp;#x521A;&amp;#x8FC7;&amp;#xFF0C;&amp;#x53E6;&amp;#x4E00;&amp;#x4E2A;&amp;#x65B0;&amp;#x5E74;&amp;#x53C8;&amp;#x8981;&amp;#x6765;&amp;#x4E86;&amp;#x3002;&amp;#x4ECE;&amp;#x67D0;&amp;#x79CD;&amp;#x610F;&amp;#x4E49;&amp;#x4E0A;&amp;#x6765;&amp;#x8BB2;">
<meta property="og:type" content="article">
<meta property="og:title" content="人啊，只能专心做一件事情">
<meta property="og:url" content="http://yoursite.com/2017/01/08/人啊，只能专心做一件事情/index.html">
<meta property="og:site_name" content="zhuimengfb's blog">
<meta property="og:description" content="&amp;#x4E00;&amp;#x4E2A;&amp;#x65B0;&amp;#x5E74;&amp;#x521A;&amp;#x8FC7;&amp;#xFF0C;&amp;#x53E6;&amp;#x4E00;&amp;#x4E2A;&amp;#x65B0;&amp;#x5E74;&amp;#x53C8;&amp;#x8981;&amp;#x6765;&amp;#x4E86;&amp;#x3002;&amp;#x4ECE;&amp;#x67D0;&amp;#x79CD;&amp;#x610F;&amp;#x4E49;&amp;#x4E0A;&amp;#x6765;&amp;#x8BB2;">
<meta property="og:updated_time" content="2017-01-09T06:37:07.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="人啊，只能专心做一件事情">
<meta name="twitter:description" content="&amp;#x4E00;&amp;#x4E2A;&amp;#x65B0;&amp;#x5E74;&amp;#x521A;&amp;#x8FC7;&amp;#xFF0C;&amp;#x53E6;&amp;#x4E00;&amp;#x4E2A;&amp;#x65B0;&amp;#x5E74;&amp;#x53C8;&amp;#x8981;&amp;#x6765;&amp;#x4E86;&amp;#x3002;&amp;#x4ECE;&amp;#x67D0;&amp;#x79CD;&amp;#x610F;&amp;#x4E49;&amp;#x4E0A;&amp;#x6765;&amp;#x8BB2;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: 'Author'
    }
  };
</script>

  <title> 人啊，只能专心做一件事情 | zhuimengfb's blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="en">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?32cc932d4c165744315fa3da1f8a235a";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">zhuimengfb's blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            Home
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            Archives
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            Tags
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                人啊，只能专心做一件事情
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">Posted on</span>
            <time itemprop="dateCreated" datetime="2017-01-08T20:50:50+08:00" content="2017-01-08">
              2017-01-08
            </time>
          </span>

          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2017/01/08/人啊，只能专心做一件事情/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2017/01/08/人啊，只能专心做一件事情/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x4E00;&#x4E2A;&#x65B0;&#x5E74;&#x521A;&#x8FC7;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x65B0;&#x5E74;&#x53C8;&#x8981;&#x6765;&#x4E86;&#x3002;&#x4ECE;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x8BB2;&#xFF0C;&#x5C06;&#x8981;&#x6765;&#x7684;&#x90A3;&#x4E2A;&#x65B0;&#x5E74;&#x8C8C;&#x4F3C;&#x4F1A;&#x66F4;&#x52A0;&#x70ED;&#x95F9;&#x4E00;&#x70B9;&#xFF0C;&#x6253;&#x724C;&#x7684;&#x6253;&#x724C;&#xFF0C;&#x6253;&#x9EBB;&#x5C06;&#x7684;&#x6253;&#x9EBB;&#x5C06;&#xFF0C;&#x6BCF;&#x5929;&#x5230;&#x4E03;&#x5927;&#x59D1;&#x516B;&#x5927;&#x59E8;&#x5BB6;&#x91CC;&#x8E6D;&#x5403;&#x8E6D;&#x559D;&#xFF0C;&#x60F3;&#x60F3;&#x5C31;&#x5F00;&#x5FC3;&#x3002;&#x6240;&#x4EE5;&#x554A;&#xFF0C;&#x867D;&#x7136;&#x79BB;&#x6625;&#x8282;&#x8FD8;&#x6709;&#x5927;&#x534A;&#x4E2A;&#x6708;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x5176;&#x5B9E;&#x5FC3;&#x91CC;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x7ED9;&#x81EA;&#x5DF1;&#x653E;&#x5047;&#x4E86;&#x3002;&#x8981;&#x4E0D;&#x662F;&#x8FD8;&#x6709;&#x4E2A;&#x5F00;&#x9898;&#x8981;&#x505A;&#xFF0C;&#x8BF4;&#x4E0D;&#x5B9A;&#x8FDE;&#x8EAB;&#x4F53;&#x4E5F;&#x5F00;&#x59CB;&#x653E;&#x5047;&#x4E86;&#x3002;&#x5509;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x70B9;&#x5C0F;&#x5C0F;&#x538C;&#x5B66;&#xFF0C;&#x4E0D;&#x8FC7;&#x5462;&#xFF0C;&#x6BCF;&#x4E2A;&#x6708;&#x90FD;&#x6709;&#x90A3;&#x4E48;&#x4E00;&#x4E24;&#x5929;&#x4E0D;&#x60F3;&#x5B66;&#x4E60;&#xFF0C;&#x5C31;&#x4E0D;&#x8C08;&#x8FD9;&#x4E9B;&#x4E86;&#xFF0C;&#x8FD8;&#x662F;&#x6765;&#x70B9;&#x6B63;&#x80FD;&#x91CF;&#x7684;&#x4E1C;&#x897F;&#x5427;&#xFF0C;&#x6BD5;&#x7ADF;&#x597D;&#x51E0;&#x5929;&#x6CA1;&#x66F4;&#x4E86;&#xFF0C;&#x4E0D;&#x80FD;&#x4E00;&#x4E0A;&#x6765;&#x5C31;&#x7ED9;&#x5927;&#x5BB6;&#x6DFB;&#x5835;&#x3002;</p>
<a id="more"></a>
<h2 id="90-&#x7684;&#x7F5A;&#x7403;&#x547D;&#x4E2D;&#x7387;&#x600E;&#x6837;&#x70BC;&#x6210;&#x7684;"><a href="#90-&#x7684;&#x7F5A;&#x7403;&#x547D;&#x4E2D;&#x7387;&#x600E;&#x6837;&#x70BC;&#x6210;&#x7684;" class="headerlink" title="90%&#x7684;&#x7F5A;&#x7403;&#x547D;&#x4E2D;&#x7387;&#x600E;&#x6837;&#x70BC;&#x6210;&#x7684;"></a>90%&#x7684;&#x7F5A;&#x7403;&#x547D;&#x4E2D;&#x7387;&#x600E;&#x6837;&#x70BC;&#x6210;&#x7684;</h2><p>&#x4ECA;&#x5929;&#x4E0D;&#x77E5;&#x9053;&#x5728;&#x54EA;&#x513F;&#x770B;&#x5230;&#x7684;&#x65B0;&#x95FB;&#xFF0C;&#x5E93;&#x91CC;&#x7684;&#x5E38;&#x89C4;&#x8D5B;&#x7F5A;&#x7403;&#x547D;&#x4E2D;&#x7387;&#x5DF2;&#x7ECF;&#x8D85;&#x8D8A;&#x7EB3;&#x4EC0;&#x6392;&#x540D;NBA&#x5386;&#x53F2;&#x7B2C;&#x4E00;&#xFF0C;90%&#x7684;&#x7F5A;&#x7403;&#x547D;&#x4E2D;&#x7387;&#x662F;&#x4EC0;&#x4E48;&#x6982;&#x5FF5;&#xFF1F;&#x90A3;&#x53EF;&#x662F;&#x7F5A;&#x5341;&#x4E2A;&#x8FDB;&#x4E5D;&#x4E2A;&#x5440;&#xFF08;&#x8BF4;&#x4E86;&#x597D;&#x50CF;&#x7B49;&#x4E8E;&#x6CA1;&#x8BF4;&#xFF09;&#xFF0C;&#x5FC3;&#x60F3;&#x5E94;&#x8BE5;&#x662F;&#x5F88;&#x5389;&#x5BB3;&#x7684;&#x6C34;&#x51C6;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x4E0B;&#x5348;&#x4E5F;&#x53BB;&#x7403;&#x573A;&#x8BD5;&#x4E86;&#x8BD5;&#xFF0C;&#x55EF;&#xFF0C;&#x7F5A;&#x5341;&#x4E2A;&#xFF0C;&#x6211;&#x4E5F;&#x8FDB;&#x4E86;&#x4E5D;&#x4E2A;&#x561B;&#xFF01;&#x54C8;&#x54C8;&#x54C8;&#xFF0C;&#x6BD5;&#x7ADF;&#x81EA;&#x5DF1;&#x662F;&#x90A3;&#x79CD;&#x624B;&#x611F;&#x6765;&#x4E86;&#xFF0C;&#x8C01;&#x4E5F;&#x6321;&#x4E0D;&#x4F4F;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x56DE;&#x60F3;&#x8D77;&#x4ECE;&#x521D;&#x4E8C;&#x5F00;&#x59CB;&#x63A5;&#x89E6;&#x7BEE;&#x7403;&#xFF0C;&#x597D;&#x50CF;&#x4E00;&#x76F4;&#x90FD;&#x662F;&#x4EE5;&#x6295;&#x7BEE;&#x89C1;&#x957F;&#xFF0C;&#x6BCF;&#x6BCF;&#x5230;&#x7BEE;&#x7403;&#x573A;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x662F;&#x8054;&#x7CFB;&#x6295;&#x7BEE;&#x3002;&#x6240;&#x4EE5;&#x65E5;&#x79EF;&#x6708;&#x7D2F;&#xFF0C;&#x5BFC;&#x81F4;&#x5176;&#x4ED6;&#x57FA;&#x672C;&#x529F;&#x4E00;&#x584C;&#x7CCA;&#x6D82;&#xFF0C;&#x53EA;&#x5269;&#x4E0B;&#x6295;&#x7BEE;&#x8FD9;&#x4E00;&#x9879;&#x8FD8;&#x52C9;&#x5F3A;&#x53EF;&#x4EE5;&#x3002;&#x597D;&#x50CF;&#x8FD8;&#x8BB0;&#x5F97;&#x53BB;&#x5E74;&#x53C2;&#x52A0;&#x8FC7;&#x4E00;&#x9879;&#x8BA1;&#x65F6;&#x4E09;&#x5206;&#x7403;&#x5927;&#x8D5B;&#xFF0C;&#x4E00;&#x5206;&#x949F;25&#x4E2A;&#x7403;&#xFF0C;&#x597D;&#x50CF;&#x6295;&#x8FDB;&#x4E86;15&#x4E2A;&#x5DEE;&#x70B9;&#x8FDB;&#x51B3;&#x8D5B;&#xFF0C;&#x73B0;&#x5728;&#x60F3;&#x8D77;&#x6765;&#x597D;&#x50CF;&#x611F;&#x89C9;&#x8FD8;&#x662F;&#x7F8E;&#x7F8E;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x554A;&#xFF0C;&#x4E13;&#x6CE8;&#x4E8E;&#x6295;&#x7BEE;&#xFF0C;&#x9020;&#x5C31;&#x4E86;&#x6295;&#x624B;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x89D2;&#x8272;&#x3002;&#x7A81;&#x7136;&#x597D;&#x60F3;&#x518D;&#x548C;&#x5927;&#x5B66;&#x7684;&#x597D;&#x53CB;&#x5728;&#x76DB;&#x590F;&#x7684;&#x591C;&#x665A;&#x5728;&#x4E1C;&#x533A;&#x62B9;&#x9ED1;&#x5355;&#x6311;&#xFF0C;&#x597D;&#x60F3;&#x56DE;&#x5230;&#x5BB6;&#x548C;&#x597D;&#x670B;&#x53CB;&#x53BB;&#x6253;&#x9EBB;&#x5C06;&#xFF0C;&#x554A;&#x5478;&#xFF0C;&#x6253;&#x7BEE;&#x7403;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x7684;NBA&#xFF0C;&#x7A81;&#x7136;&#x6709;&#x4E00;&#x79CD;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x8BF4;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x4EE5;&#x524D;&#x5F88;&#x7A00;&#x6709;&#x7684;&#x4E09;&#x53CC;&#x611F;&#x89C9;&#x73B0;&#x5728;&#x4FE1;&#x624B;&#x62C8;&#x6765;&#xFF0C;&#x4EE5;&#x524D;&#x5F88;&#x5C11;&#x7684;40+&#x73B0;&#x5728;&#x611F;&#x89C9;&#x6BCF;&#x5929;&#x90FD;&#x6709;&#x3002;&#x65F6;&#x4EE3;&#x53D8;&#x4E86;&#xFF0C;&#x7BEE;&#x7403;&#x4E5F;&#x53D8;&#x4E86;&#xFF0C;&#x867D;&#x7136;&#x6CA1;&#x6709;&#x89C1;&#x8BC1;&#x897F;&#x79D1;&#x4E1C;&#x827E;&#xFF0C;&#x5317;&#x5361;&#x5357;&#x9EA6;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x8FD8;&#x662F;&#x6709;&#x5E78;&#x89C1;&#x8BC1;&#x4E86;&#x79D1;&#x6BD4;&#x548C;&#x9EA6;&#x8FEA;&#x7684;&#x6700;&#x540E;&#x65F6;&#x4EE3;&#x3002;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x5F88;&#x96BE;&#x5728;&#x770B;&#x5230;&#x90A3;&#x4E48;&#x98D8;&#x9038;&#x7684;&#x7403;&#x98CE;&#xFF0C;&#x518D;&#x96BE;&#x770B;&#x5230;&#x7F8E;&#x5982;&#x753B;&#x7684;&#x5E72;&#x62D4;&#x548C;&#x540E;&#x4EF0;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;NBA&#x91CC;&#x9762;&#x7684;&#x7403;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x53EA;&#x6709;&#x65E5;&#x590D;&#x4E00;&#x65E5;&#x7684;&#x6BD4;&#x8D5B;&#x3001;&#x8BAD;&#x7EC3;&#xFF0C;&#x624D;&#x53EF;&#x80FD;&#x6210;&#x4E3A;&#x5DE8;&#x661F;&#x95EA;&#x8000;&#x8D5B;&#x573A;&#xFF0C;&#x53EA;&#x6709;&#x4E13;&#x6CE8;&#x4E8E;&#x7BEE;&#x7403;&#xFF0C;&#x624D;&#x80FD;&#x5438;&#x5F15;&#x4E00;&#x4EE3;&#x53C8;&#x4E00;&#x4EE3;&#x7684;&#x5C0F;&#x5B69;&#x62B1;&#x8D77;&#x7BEE;&#x7403;&#x3001;&#x8D70;&#x5411;&#x7403;&#x573A;&#x3002;</p>
<h2 id="&#x4E00;&#x767E;&#x4E07;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x600E;&#x6837;&#x5199;&#x5B8C;&#x7684;"><a href="#&#x4E00;&#x767E;&#x4E07;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x600E;&#x6837;&#x5199;&#x5B8C;&#x7684;" class="headerlink" title="&#x4E00;&#x767E;&#x4E07;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x600E;&#x6837;&#x5199;&#x5B8C;&#x7684;"></a>&#x4E00;&#x767E;&#x4E07;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x600E;&#x6837;&#x5199;&#x5B8C;&#x7684;</h2><p>&#x5509;&#xFF0C;&#x5B9E;&#x5728;&#x4E0D;&#x77E5;&#x9053;&#x5199;&#x5565;&#x4E86;&#xFF0C;&#x968F;&#x4FBF;&#x8D77;&#x4E2A;&#x5C0F;&#x6807;&#x9898;&#x51D1;&#x51D1;&#x5B57;&#x6570;&#x3002;&#x611F;&#x89C9;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#x90FD;&#x4FE1;&#x5949;&#x8005;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x91CF;&#x53D8;&#x5F15;&#x8D77;&#x8D28;&#x53D8;&#x3002;&#x6DF1;&#x77E5;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#x5929;&#x624D;&#x5F88;&#x5C11;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x90FD;&#x662F;&#x666E;&#x901A;&#x4EBA;&#xFF0C;&#x5305;&#x62EC;&#x6211;&#x81EA;&#x5DF1;&#xFF0C;&#x8981;&#x60F3;&#x8FFD;&#x8D76;&#x5929;&#x624D;&#xFF0C;&#x53EA;&#x6709;&#x6BD4;&#x4ED6;&#x4EEC;&#x4ED8;&#x51FA;&#x66F4;&#x591A;&#x52AA;&#x529B;&#x3002;&#x6240;&#x4EE5;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#xFF0C;&#x4E00;&#x76F4;&#x90FD;&#x662F;&#x9760;&#x5237;&#x6210;&#x957F;&#x3002;&#x4E00;&#x5F00;&#x59CB;&#x4E0D;&#x4F1A;&#x82F1;&#x8BED;&#xFF0C;&#x6284;&#x5199;&#x5355;&#x8BCD;&#x7684;&#x65F6;&#x5019;&#x522B;&#x4EBA;&#x6284;&#x4E00;&#x904D;&#xFF0C;&#x6211;&#x6284;&#x4E24;&#x8FB9;&#xFF0C;&#x522B;&#x4EBA;&#x505A;&#x4E00;&#x672C;&#x4E60;&#x9898;&#x96C6;&#xFF0C;&#x6211;&#x505A;&#x4E24;&#x672C;&#x751A;&#x81F3;&#x66F4;&#x591A;&#x3002;&#x522B;&#x4EBA;&#x5199;&#x4E00;&#x767E;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x6211;&#x5199;&#x4E00;&#x5343;&#x884C;&#x3002;&#x8BF6;&#xFF0C;&#x597D;&#x50CF;&#x6709;&#x70B9;&#x5938;&#x5F20;&#x8FC7;&#x5934;&#x4E86;&#xFF0C;o(&#x256F;&#x25A1;&#x2570;)o&#x3002;</p>
<p>&#x4E5F;&#x6CA1;&#x6709;&#x7EDF;&#x8BA1;&#x5230;&#x73B0;&#x5728;&#x4E3A;&#x6B62;&#xFF0C;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x5199;&#x8FC7;&#x591A;&#x5C11;&#x4EE3;&#x7801;&#x4E86;&#xFF0C;&#x4E00;&#x767E;&#x4E07;&#x884C;&#x4E5F;&#x8BB8;&#x662F;&#x4E2A;&#x865A;&#x6570;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x81EA;&#x5DF1;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x6709;&#x5199;&#x5230;&#x4E00;&#x767E;&#x4E07;&#x884C;&#x3002;&#x4ECE;&#x81EA;&#x8EAB;&#x6765;&#x770B;&#xFF0C;&#x591A;&#x5199;&#x4EE3;&#x7801;&#x786E;&#x5B9E;&#x4F1A;&#x6210;&#x957F;&#xFF0C;&#x8BB0;&#x5F97;&#x4E00;&#x5F00;&#x59CB;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#x662F;&#x79BB;&#x4E0D;&#x5F00;&#x4E66;&#x672C;&#xFF0C;&#x79BB;&#x4E0D;&#x5F00;&#x7F51;&#x7EDC;&#x7684;&#xFF0C;&#x5199;&#x7740;&#x5199;&#x7740;&#xFF0C;&#x6709;&#x4E00;&#x5929;&#x7A81;&#x7136;&#x53D1;&#x73B0;&#xFF0C;&#x4E0D;&#x7528;&#x4E0A;&#x7F51;&#x5176;&#x5B9E;&#x4E5F;&#x53EF;&#x4EE5;&#x628A;&#x4EE3;&#x7801;&#x5199;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x719F;&#x7EC3;&#x5EA6;&#x5427;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x8FD9;&#x51E0;&#x5E74;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x4E13;&#x6CE8;&#x4E8E;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4EE3;&#x7801;&#x7684;&#x638C;&#x63E1;&#x5EA6;&#x4E5F;&#x8FD8;&#x7B97;&#x52C9;&#x5F3A;&#x53EF;&#x4EE5;&#xFF0C;&#x4E09;&#x4E24;&#x4E2A;&#x5C0F;&#x65F6;&#x5199;&#x4E2A;&#x7B80;&#x5355;&#x7684;App&#x6216;&#x8005;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;&#x867D;&#x7136;&#x81EA;&#x5DF1;&#x662F;&#x5B66;&#x901A;&#x4FE1;&#x7684;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x901A;&#x4FE1;&#x77E5;&#x8BC6;&#x4E86;&#x89E3;&#x7684;&#x5374;&#x5C11;&#x5F97;&#x53EF;&#x601C;&#xFF0C;&#x6240;&#x4EE5;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#xFF0C;&#x4E00;&#x5B9A;&#x4E0D;&#x8981;&#x4E24;&#x5929;&#x6253;&#x6E14;&#x4E09;&#x5929;&#x6652;&#x7F51;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x4E13;&#x6CE8;&#x5730;&#x8D70;&#x4E0B;&#x53BB;&#xFF0C;&#x4E0D;&#x7136;&#x6709;&#x53EF;&#x80FD;&#x6700;&#x540E;&#x5565;&#x4E5F;&#x635E;&#x4E0D;&#x7740;&#x3002;</p>
<h2 id="&#x628A;&#x81EA;&#x5DF1;&#x5173;&#x5728;&#x5C0F;&#x9ED1;&#x5C4B;&#x662F;&#x4EC0;&#x4E48;&#x4F53;&#x9A8C;"><a href="#&#x628A;&#x81EA;&#x5DF1;&#x5173;&#x5728;&#x5C0F;&#x9ED1;&#x5C4B;&#x662F;&#x4EC0;&#x4E48;&#x4F53;&#x9A8C;" class="headerlink" title="&#x628A;&#x81EA;&#x5DF1;&#x5173;&#x5728;&#x5C0F;&#x9ED1;&#x5C4B;&#x662F;&#x4EC0;&#x4E48;&#x4F53;&#x9A8C;"></a>&#x628A;&#x81EA;&#x5DF1;&#x5173;&#x5728;&#x5C0F;&#x9ED1;&#x5C4B;&#x662F;&#x4EC0;&#x4E48;&#x4F53;&#x9A8C;</h2><p>&#x4E0D;&#x8FC7;&#x554A;&#xFF0C;&#x4EBA;&#x6BD5;&#x7ADF;&#x5F97;&#x9762;&#x5BF9;&#x73B0;&#x5B9E;&#xFF0C;&#x8981;&#x6BD5;&#x4E1A;&#x5C31;&#x8981;&#x5199;&#x8BBA;&#x6587;&#xFF0C;&#x8981;&#x5199;&#x8BBA;&#x6587;&#xFF0C;&#x5C31;&#x8981;&#x628A;&#x81EA;&#x5DF1;&#x5173;&#x5728;&#x5C0F;&#x9ED1;&#x5C4B;&#xFF0C;&#x54A6;&#xFF0C;&#x8FD9;&#x4E2A;&#x903B;&#x8F91;&#x597D;&#x50CF;&#x4E0D;&#x5BF9;&#x3002;&#x54C8;&#x54C8;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x5E76;&#x4E0D;&#x662F;&#x6211;&#xFF0C;&#x800C;&#x662F;&#x81EA;&#x5DF1;&#x633A;&#x4F69;&#x670D;&#x7684;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#xFF0C;&#x611F;&#x89C9;&#x538B;&#x529B;&#x9AA4;&#x589E;&#x3002;&#x7814;&#x4E00;&#x7684;&#x65F6;&#x5019;&#x4E0A;&#x4E0A;&#x8BFE;&#xFF0C;&#x505A;&#x505A;&#x9879;&#x76EE;&#xFF0C;&#x518D;&#x5212;&#x5212;&#x6C34;&#xFF0C;&#x65F6;&#x95F4;&#x5C31;&#x8FD9;&#x6837;&#x8FC7;&#x4E86;&#xFF0C;&#x90A3;&#x65F6;&#x5019;&#x57FA;&#x672C;&#x65E0;&#x5FE7;&#x65E0;&#x8651;&#x3002;&#x7136;&#x800C;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#xFF0C;&#x8F6C;&#x773C;&#x5C31;&#x5230;&#x4E86;&#x8981;&#x5199;&#x5C0F;&#x8BBA;&#x6587;&#xFF0C;&#x8981;&#x5F00;&#x59CB;&#x627E;&#x5B9E;&#x4E60;&#xFF0C;&#x627E;&#x5DE5;&#x4F5C;&#xFF0C;&#x518D;&#x7136;&#x540E;&#x5C31;&#x8981;&#x51C6;&#x5907;&#x6BD5;&#x4E1A;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#xFF0C;&#x62C5;&#x5B50;&#x7A81;&#x7136;&#x91CD;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x538B;&#x529B;&#x4E5F;&#x7A81;&#x7136;&#x591A;&#x4E86;&#x597D;&#x591A;&#x3002;&#x5C24;&#x5176;&#x662F;&#x5728;&#x4E0D;&#x64C5;&#x957F;&#x5199;&#x8BBA;&#x6587;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4EE5;&#x53CA;&#x627E;&#x5B9E;&#x4E60;&#x627E;&#x5DE5;&#x4F5C;&#x89C9;&#x5F97;&#x8FD8;&#x6CA1;&#x6709;&#x5341;&#x8DB3;&#x628A;&#x63E1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7A81;&#x7136;&#x6709;&#x70B9;&#x751F;&#x65E0;&#x53EF;&#x604B;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x65F6;&#x5019;&#x554A;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x5173;&#x5728;&#x5C0F;&#x9ED1;&#x5C4B;&#x91CC;&#x9762;&#xFF0C;&#x4E13;&#x6CE8;&#x4E8E;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x6709;&#x8BA1;&#x5212;&#x5730;&#x5B8C;&#x6210;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x5E94;&#x8BE5;&#x4F1A;&#x597D;&#x5F88;&#x591A;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x554A;&#xFF0C;&#x7ED9;&#x81EA;&#x5DF1;&#x7ACB;&#x4E00;&#x4E2A;flag&#xFF0C;&#x5728;&#x56DE;&#x5BB6;&#x524D;&#x628A;&#x8BBA;&#x6587;&#x7684;idea&#x6574;&#x7406;&#x6E05;&#x695A;&#xFF0C;&#x8DD1;&#x51FA;&#x4E00;&#x4E9B;&#x5BF9;&#x6BD4;&#x4EFF;&#x771F;&#xFF0C;&#x7136;&#x540E;&#x4E09;&#x6708;&#x4EFD;&#x7684;&#x6837;&#x5B50;&#x628A;&#x8BBA;&#x6587;&#x641E;&#x5B9A;&#xFF0C;&#x7136;&#x540E;&#x5F00;&#x59CB;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x7684;Coding&#x6C34;&#x5E73;&#xFF0C;&#x4E89;&#x53D6;&#x627E;&#x5230;&#x4E00;&#x4EFD;&#x597D;&#x7684;&#x5B9E;&#x4E60;&#x3002;&#x4E5F;&#x5B66;&#x524D;&#x8F88;&#x4E00;&#x6837;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x5173;&#x5728;&#x5C0F;&#x9ED1;&#x5C4B;&#x91CC;&#x9762;&#xFF0C;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x6765;&#x5B8C;&#x6210;&#x8BA1;&#x5212;&#xFF0C;&#x4F53;&#x9A8C;&#x4E00;&#x4E0B;&#x628A;&#x81EA;&#x5DF1;&#x5173;&#x5728;&#x5C0F;&#x9ED1;&#x5C4B;&#x91CC;&#x9762;&#x4F1A;&#x662F;&#x4E00;&#x79CD;&#x600E;&#x6837;&#x795E;&#x5947;&#x7684;&#x4F53;&#x9A8C;&#x3002;</p>
<h2 id="&#x7231;&#x4E00;&#x4EBA;&#xFF0C;&#x62E9;&#x4E00;&#x4E8B;&#xFF0C;&#x7EC8;&#x4E00;&#x751F;"><a href="#&#x7231;&#x4E00;&#x4EBA;&#xFF0C;&#x62E9;&#x4E00;&#x4E8B;&#xFF0C;&#x7EC8;&#x4E00;&#x751F;" class="headerlink" title="&#x7231;&#x4E00;&#x4EBA;&#xFF0C;&#x62E9;&#x4E00;&#x4E8B;&#xFF0C;&#x7EC8;&#x4E00;&#x751F;"></a>&#x7231;&#x4E00;&#x4EBA;&#xFF0C;&#x62E9;&#x4E00;&#x4E8B;&#xFF0C;&#x7EC8;&#x4E00;&#x751F;</h2><p>&#x80FD;&#x770B;&#x5230;&#x8FD9;&#x91CC;&#x7684;&#x90FD;&#x662F;&#x771F;&#x7231;&#x554A;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x8111;&#x6D77;&#x4E2D;&#x4E3A;&#x5565;&#x7A81;&#x7136;&#x6D6E;&#x73B0;&#x51FA;&#x8FD9;&#x4E2A;&#x6807;&#x9898;&#x3002;&#x4EBA;&#x53EA;&#x80FD;&#x4E13;&#x6CE8;&#x4E8E;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x662F;&#x77ED;&#x671F;&#x76EE;&#x6807;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x957F;&#x671F;&#x7684;&#x5B8F;&#x4F1F;&#x76EE;&#x6807;&#x3002;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x65E5;&#x5B50;&#x91CC;&#x9762;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x771F;&#x7684;&#x80FD;&#x505A;&#x5230;&#x4E13;&#x6CE8;&#x4E8E;&#x4E00;&#x4EF6;&#x4E8B;&#x3002;&#x827E;&#x739B;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x53BB;&#x5C55;&#x5F00;&#x8FD9;&#x4E2A;&#x6807;&#x9898;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x6BB5;&#x5C31;&#x5230;&#x6B64;&#x4E3A;&#x6B62;&#xFF0C;&#x5927;&#x5BB6;&#x81EA;&#x884C;&#x8111;&#x8865;&#x5427;&#x3002;</p>
<p>&#x7231;&#x4E00;&#x4EBA;&#xFF0C;&#x62E9;&#x4E00;&#x4E8B;&#xFF0C;&#x7EC8;&#x4E00;&#x751F;&#xFF0C;&#x8FD9;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x79CD;&#x751F;&#x6D3B;&#x6001;&#x5EA6;&#x3002;</p>
<p>&#x4E4B;&#x524D;&#x7684;&#x6280;&#x672F;&#x6587;&#x7AE0;&#x597D;&#x50CF;&#x597D;&#x591A;&#x4EBA;&#x90FD;&#x770B;&#x4E0D;&#x61C2;&#xFF0C;&#x6240;&#x4EE5;&#x5148;&#x968F;&#x4FBF;&#x778E;&#x5199;&#x5199;&#x3002;&#x96BE;&#x5F97;&#x5199;&#x4E00;&#x6B21;&#x9E21;&#x6C64;&#x6587;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x7897;&#x6C64;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x7897;&#x6BD2;&#x6C64;&#xFF0C;&#x6240;&#x4EE5;&#x559D;&#x6C64;&#x8981;&#x8C28;&#x614E;&#xFF0C;&#x5C0F;&#x5FC3;&#x4E2D;&#x6BD2;&#x8EAB;&#x4EA1;&#xFF0C;&#x54C8;&#x54C8;&#x54C8;&#x3002;</p>

      
    </div>
    
    <div>
      
        
      
    </div>

    <div>
      
        
      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/有意思的东西/" rel="tag">#有意思的东西</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/12/30/有些事只有勇敢地去做了才知道结果会怎样/" rel="next" title="有些事只有勇敢地去做了才知道结果会怎样">
                <i class="fa fa-chevron-left"></i> 有些事只有勇敢地去做了才知道结果会怎样
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2017/01/08/人啊，只能专心做一件事情/"
           data-title="人啊，只能专心做一件事情" data-url="http://yoursite.com/2017/01/08/人啊，只能专心做一件事情/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            Table of Contents
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            Overview
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/uploads/avatar.png"
               alt="zhuimengfb" />
          <p class="site-author-name" itemprop="name">zhuimengfb</p>
          <p class="site-description motion-element" itemprop="description">persuing happiness</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">23</span>
              <span class="site-state-item-name">posts</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">5</span>
                <span class="site-state-item-name">tags</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#90-的罚球命中率怎样炼成的"><span class="nav-number">1.</span> <span class="nav-text">90%的罚球命中率怎样炼成的</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#一百万行的代码是怎样写完的"><span class="nav-number">2.</span> <span class="nav-text">一百万行的代码是怎样写完的</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#把自己关在小黑屋是什么体验"><span class="nav-number">3.</span> <span class="nav-text">把自己关在小黑屋是什么体验</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#爱一人，择一事，终一生"><span class="nav-number">4.</span> <span class="nav-text">爱一人，择一事，终一生</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">zhuimengfb</span>
</div>

<div class="powered-by">
  Powered by <a class="theme-link" href="http://hexo.io">Hexo</a>
</div>

<div class="theme-info">
  Theme -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"zhuimengfbblog"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  
  

  

  

</body>
</html>
