<!doctype html>



  


<html class="theme-next muse use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  




<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="有意思的东西," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x6709;&amp;#x4E9B;&amp;#x4E8B;&amp;#xFF0C;&amp;#x53EA;&amp;#x6709;&amp;#x53BB;&amp;#x505A;&amp;#x4E86;&amp;#x624D;&amp;#x77E5;&amp;#x9053;&amp;#x7ED3;&amp;#x679C;&amp;#x4F1A;&amp;#x6F14;&amp;#x53D8;&amp;#x6210;&amp;#x600E;&amp;#x6837;&amp;#xFF0C;&amp;#x4E0D;&amp;#x8BBA;&amp;#x662F;&amp;#x597D;">
<meta property="og:type" content="article">
<meta property="og:title" content="有些事只有勇敢地去做了才知道结果会怎样">
<meta property="og:url" content="http://yoursite.com/2016/12/30/有些事只有勇敢地去做了才知道结果会怎样/index.html">
<meta property="og:site_name" content="zhuimengfb's blog">
<meta property="og:description" content="&amp;#x6709;&amp;#x4E9B;&amp;#x4E8B;&amp;#xFF0C;&amp;#x53EA;&amp;#x6709;&amp;#x53BB;&amp;#x505A;&amp;#x4E86;&amp;#x624D;&amp;#x77E5;&amp;#x9053;&amp;#x7ED3;&amp;#x679C;&amp;#x4F1A;&amp;#x6F14;&amp;#x53D8;&amp;#x6210;&amp;#x600E;&amp;#x6837;&amp;#xFF0C;&amp;#x4E0D;&amp;#x8BBA;&amp;#x662F;&amp;#x597D;">
<meta property="og:updated_time" content="2016-12-29T16:42:59.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="有些事只有勇敢地去做了才知道结果会怎样">
<meta name="twitter:description" content="&amp;#x6709;&amp;#x4E9B;&amp;#x4E8B;&amp;#xFF0C;&amp;#x53EA;&amp;#x6709;&amp;#x53BB;&amp;#x505A;&amp;#x4E86;&amp;#x624D;&amp;#x77E5;&amp;#x9053;&amp;#x7ED3;&amp;#x679C;&amp;#x4F1A;&amp;#x6F14;&amp;#x53D8;&amp;#x6210;&amp;#x600E;&amp;#x6837;&amp;#xFF0C;&amp;#x4E0D;&amp;#x8BBA;&amp;#x662F;&amp;#x597D;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Muse',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: 'Author'
    }
  };
</script>

  <title> 有些事只有勇敢地去做了才知道结果会怎样 | zhuimengfb's blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="en">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?32cc932d4c165744315fa3da1f8a235a";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">zhuimengfb's blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            Home
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            Archives
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            Tags
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                有些事只有勇敢地去做了才知道结果会怎样
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">Posted on</span>
            <time itemprop="dateCreated" datetime="2016-12-30T00:39:23+08:00" content="2016-12-30">
              2016-12-30
            </time>
          </span>

          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/12/30/有些事只有勇敢地去做了才知道结果会怎样/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/12/30/有些事只有勇敢地去做了才知道结果会怎样/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x6709;&#x4E9B;&#x4E8B;&#xFF0C;&#x53EA;&#x6709;&#x53BB;&#x505A;&#x4E86;&#x624D;&#x77E5;&#x9053;&#x7ED3;&#x679C;&#x4F1A;&#x6F14;&#x53D8;&#x6210;&#x600E;&#x6837;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x597D;&#x7684;&#x8FD8;&#x662F;&#x574F;&#x7684;&#x3002;&#x6709;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x53EA;&#x6709;&#x7EC6;&#x5FC3;&#x53BB;&#x770B;&#x4E86;&#xFF0C;&#x624D;&#x77E5;&#x9053;&#xFF0C;&#x54E6;&#xFF0C;&#x539F;&#x6765;&#x662F;&#x8FD9;&#x6837;&#x554A;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x5199;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x539F;&#x6765;&#x81EA;&#x5DF1;&#x4E5F;&#x53EF;&#x5F53;&#x6807;&#x9898;&#x515A;&#x3002;&#x54C8;&#x54C8;&#x54C8;&#xFF0C;&#x5F00;&#x4E2A;&#x73A9;&#x7B11;&#xFF0C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x8FD8;&#x662F;&#x6709;&#x70B9;&#x4E1C;&#x897F;&#x7684;&#xFF0C;&#x8BF7;&#x6162;&#x6162;&#x770B;&#x3002;</p>
<a id="more"></a>
<h2 id="&#x8D77;&#x56E0;"><a href="#&#x8D77;&#x56E0;" class="headerlink" title="&#x8D77;&#x56E0;"></a>&#x8D77;&#x56E0;</h2><p>&#x4E8B;&#x60C5;&#x7684;&#x8D77;&#x56E0;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x5728;Android&#x4E2D;&#xFF0C;&#x5F39;&#x51FA;&#x4E00;&#x4E2A;Toast&#x6D88;&#x606F;&#x6846;&#x6216;&#x8005;Snackbar&#x6D88;&#x606F;&#x6846;&#x5199;&#x6CD5;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#x3002;</p>
<pre><code>Toast.makeText(context, &quot;123&quot;, Toast.LENGTH_SHORT).show();
Snackbar.make(view, &quot;123&quot;, Snackbar.LENGTH_SHORT).show();
</code></pre><p>&#x5BF9;&#x4E8E;Toast&#xFF0C;&#x7B2C;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x6709;<em>Toast.LENGTH_SHORT</em>&#x548C;<em>Toast.LENGTH_LONG</em>&#x4E24;&#x79CD;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;Snackbar&#x5219;&#x8FD8;&#x591A;&#x4E86;&#x4E00;&#x4E2A;&#x65E0;&#x9650;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x4F7F;&#x5F97;Snackbar&#x53EF;&#x4EE5;&#x56FA;&#x5B9A;&#x5728;&#x5C4F;&#x5E55;&#x5E95;&#x90E8;&#x3002;&#x8BB0;&#x5F97;&#x521A;&#x5F00;&#x59CB;&#x5B66;Android&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x77E5;&#x9053;&#x7B2C;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x4E00;&#x4E2A;int&#x578B;&#x7684;&#x5C31;&#x591F;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x5F00;&#x59CB;&#x7528;eclipse&#x5F00;&#x53D1;&#x65F6;&#x4F1A;&#x5076;&#x5C14;&#x76F4;&#x63A5;&#x586B;&#x5199;&#x6570;&#x5B57;&#x3002;&#x4F46;&#x968F;&#x7740;&#x540E;&#x6765;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x7684;&#x63D0;&#x9AD8;&#xFF0C;&#x4F1A;&#x76F4;&#x63A5;&#x5199;&#x4E0A;&#x8FF0;&#x51E0;&#x79CD;&#x53C2;&#x6570;&#x3002;&#x4ECA;&#x5929;&#x5076;&#x7136;&#x5728;Android Studio&#x4E0A;&#x53D1;&#x73B0;&#xFF0C;&#x586B;&#x5199;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x7ADF;&#x7136;&#x4F1A;&#x51FA;&#x73B0;&#x7EA2;&#x7EBF;&#x63D0;&#x793A;&#x8868;&#x793A;&#x53C2;&#x6570;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x867D;&#x7136;&#x5B9E;&#x9645;&#x4E0A;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x3002;&#x601D;&#x8003;&#xFF1A;<strong>&#x4E3A;&#x5565;&#x53EA;&#x9700;&#x8981;&#x6574;&#x578B;&#x6570;&#x7684;&#x53C2;&#x6570;&#x586B;&#x5199;&#x4E86;&#x6574;&#x578B;&#x6570;&#x4F1A;&#x6709;&#x53C2;&#x6570;&#x4E0D;&#x5F53;&#x7684;&#x63D0;&#x793A;&#xFF1F;</strong></p>
<p>&#x7A0D;&#x5FAE;&#x601D;&#x8003;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x6709;&#x6CE8;&#x89E3;&#x9650;&#x5236;&#x53C2;&#x6570;&#x53EF;&#x9009;&#x8303;&#x56F4;&#xFF0C;&#x4E8E;&#x662F;&#x8FFD;&#x7740;&#x6E90;&#x7801;&#x5F80;&#x4E0B;&#x770B;&#xFF0C;&#x679C;&#x7136;&#x53C2;&#x6570;&#x4E0A;&#x591A;&#x4E86;&#x4E00;&#x4E2A;@Duration&#x6CE8;&#x89E3;&#x3002;</p>
<pre><code>public static Toast makeText(Context context, CharSequence text, @Duration int duration)
</code></pre><p>&#x7136;&#x540E;&#x518D;&#x770B;@Duration&#x6CE8;&#x89E3;</p>
<pre><code>@IntDef({LENGTH_SHORT, LENGTH_LONG})
@Retention(RetentionPolicy.SOURCE)
public @interface Duration {}
</code></pre><p>&#x8868;&#x660E;&#x6CE8;&#x89E3;&#x53EA;&#x5728;&#x6E90;&#x4EE3;&#x7801;&#x7EA7;&#x522B;&#x4FDD;&#x7559;,&#x7F16;&#x8BD1;&#x65F6;&#x5C31;&#x4F1A;&#x88AB;&#x5FFD;&#x7565;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x6709;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x53C2;&#x6570;&#x3002;&#x8FD9;&#x4E5F;&#x89E3;&#x91CA;&#x4E86;&#x4E3A;&#x5565;&#x76F4;&#x63A5;&#x8FD0;&#x884C;&#x6CA1;&#x6709;&#x9519;&#xFF0C;&#x56E0;&#x4E3A;&#x7F16;&#x8BD1;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x6CE8;&#x89E3;&#x5C31;&#x4E0D;&#x5728;&#x4E86;&#xFF0C;&#x4F20;&#x5165;&#x6574;&#x578B;&#x6570;&#x4E0D;&#x4F1A;&#x51FA;&#x9519;&#x3002;</p>
<p>&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x4E00;&#x4EF6;&#x5C0F;&#x4E8B;&#xFF0C;&#x624D;&#x53D1;&#x73B0;&#x5982;&#x679C;&#x4E0D;&#x53BB;&#x7EC6;&#x770B;&#xFF0C;&#x662F;&#x4E0D;&#x4F1A;&#x77E5;&#x9053;&#x8FD8;&#x6709;&#x8FD9;&#x79CD;&#x4E1C;&#x897F;&#x7684;&#x5B58;&#x5728;&#x3002;&#x56E0;&#x4E3A;Toasth&#x8FD9;&#x4E2A;&#x8BED;&#x53E5;&#x5C11;&#x8BF4;&#x4E5F;&#x5199;&#x4E86;&#x51E0;&#x767E;&#x6B21;&#x4E86;&#xFF0C;&#x672C;&#x4EE5;&#x4E3A;&#x5176;&#x4E2D;&#x6CA1;&#x5565;&#x53EF;&#x770B;&#x7684;&#xFF0C;&#x8FD8;&#x662F;&#x592A;&#x5E74;&#x8F7B;&#x3002;</p>
<h2 id="&#x7ECF;&#x8FC7;"><a href="#&#x7ECF;&#x8FC7;" class="headerlink" title="&#x7ECF;&#x8FC7;"></a>&#x7ECF;&#x8FC7;</h2><p>&#x60F3;&#x5230;&#x8FD9;&#x4E2A;&#xFF0C;&#x7136;&#x540E;&#x60F3;&#x5230;&#x4E86;Google&#xFF0C;&#x4E4B;&#x524D;&#x5F88;&#x597D;&#x5947;&#x4E3A;&#x5565;Google&#x8981;&#x63A8;&#x51FA;Material Design&#x8BBE;&#x8BA1;&#x89C4;&#x8303;&#xFF0C;&#x672C;&#x672C;&#x5206;&#x5206;&#x5730;&#x628A;Android&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4F18;&#x5316;&#x597D;&#x4E00;&#x70B9;&#xFF0C;&#x591A;&#x505A;&#x5E95;&#x5C42;&#x7684;&#x4F18;&#x5316;&#x4E0D;&#x5C31;&#x884C;&#x4E86;&#x561B;&#xFF0C;&#x5177;&#x4F53;UI&#x957F;&#x600E;&#x6837;&#x5C31;&#x7559;&#x7740;&#x5404;&#x5BB6;&#x5382;&#x5546;&#x81EA;&#x5B9A;&#x4E49;&#x53BB;&#x5427;&#x3002;&#x76F4;&#x5230;&#x540E;&#x6765;&#xFF0C;Google&#x8981;&#x6C42;&#x5F00;&#x673A;&#x52A8;&#x753B;&#x5FC5;&#x987B;&#x5305;&#x542B;powered by Android&#x51E0;&#x4E2A;&#x8BCD;&#xFF0C;&#x5230;&#x73B0;&#x5728;&#x706B;&#x817F;&#x80A0;&#x4EE3;&#x5DE5;&#x7684;pixel&#x8FDE;&#x4E00;&#x70B9;htc&#x7684;&#x54C1;&#x724C;&#x90FD;&#x6CA1;&#x6709;&#x7559;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x51FA;Google&#x662F;&#x771F;&#x7684;&#x60F3;&#x6536;&#x56DE;Android&#x7684;&#x63A7;&#x5236;&#x6743;&#xFF0C;&#x7EDF;&#x4E00;Android&#x89C4;&#x8303;&#x3002;&#x4E0D;&#x5F97;&#x4E0D;&#x627F;&#x8BA4;&#xFF0C;&#x5929;&#x671D;&#x7684;Android&#x4EFD;&#x989D;&#x5728;&#x5168;&#x7403;&#x5E02;&#x573A;&#x4E0A;&#x5360;&#x636E;&#x4E86;&#x5F88;&#x5927;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x4E4B;&#x524D;&#x7684;&#x79CD;&#x79CD;&#x539F;&#x56E0;&#xFF0C;Android&#x6838;&#x5FC3;&#x7684;GMS&#x670D;&#x52A1;&#x5E76;&#x6CA1;&#x6CD5;&#x5728;&#x5929;&#x671D;&#x4F7F;&#x7528;&#xFF0C;&#x4E8E;&#x662F;&#x5929;&#x9AD8;&#x7687;&#x5E1D;&#x8FDC;&#xFF0C;Google&#x5E76;&#x7BA1;&#x4E0D;&#x5230;&#x8FD9;&#x91CC;&#x6765;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5927;&#x5929;&#x671D;&#x7684;Android&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x4E94;&#x82B1;&#x516B;&#x95E8;&#xFF0C;&#x5404;&#x5F0F;&#x5404;&#x6837;&#xFF0C;&#x867D;&#x7136;&#x6D88;&#x8D39;&#x8005;&#x5F88;&#x4E50;&#x610F;&#x770B;&#x5230;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4F46;&#x786E;&#x5B9E;&#x82E6;&#x4E86;&#x6211;&#x4EEC;&#x8FD9;&#x4E9B;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x660E;&#x660E;&#x5728;&#x8FD9;&#x4E2A;&#x624B;&#x673A;&#x4E0A;&#x597D;&#x597D;&#x7684;&#xFF0C;&#x6362;&#x5230;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x624B;&#x673A;&#x5C31;FC&#x4E86;&#x3002;&#x6240;&#x4EE5;Android&#x7A0B;&#x5E8F;&#x5458;&#x4E00;&#x822C;&#x90FD;&#x4F1A;&#x7FA1;&#x6155;&#x9694;&#x58C1;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x9002;&#x914D;&#x51E0;&#x4E2A;&#x7CFB;&#x7EDF;&#x7248;&#x672C;&#x3001;&#x51E0;&#x4E2A;&#x5C4F;&#x5E55;&#x5C3A;&#x5BF8;&#x5C31;&#x597D;&#x4E86;&#xFF0C;&#x800C;Android&#xFF0C;&#x51E0;&#x5341;&#x4E2A;&#x90FD;&#x4E0D;&#x6B62;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5F53;Material Design&#x51FA;&#x6765;&#x4E4B;&#x540E;&#xFF0C;Android&#x7A0B;&#x5E8F;&#x5458;&#x7EC8;&#x4E8E;&#x677E;&#x4E86;&#x4E00;&#x53E3;&#x6C14;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x8BBE;&#x8BA1;&#x89C4;&#x8303;&#x4E86;&#x3002;&#x7136;&#x800C;&#x8FD8;&#x662F;&#x6211;&#x4EEC;&#x7EC8;&#x7A76;&#x662F;&#x592A;&#x5E74;&#x8F7B;&#x4E86;&#xFF0C;&#x867D;&#x7136;Material Design&#x5DF2;&#x7ECF;&#x63A8;&#x51FA;&#x597D;&#x51E0;&#x5E74;&#x4E86;&#xFF0C;&#x4F46;&#x56FD;&#x5185;&#x5F88;&#x591A;&#x5E94;&#x7528;&#x4F9D;&#x7136;&#x6CA1;&#x6709;&#x9075;&#x5FAA;&#x8FD9;&#x4E2A;&#x8BBE;&#x8BA1;&#x89C4;&#x8303;&#x3002;&#x7A76;&#x5176;&#x539F;&#x56E0;&#xFF1A;&#x5927;&#x516C;&#x53F8;&#x7684;&#x5E94;&#x7528;&#x6539;&#x52A8;&#x8D77;&#x6765;&#x592A;&#x9EBB;&#x70E6;&#xFF0C;&#x4E0D;&#x60F3;&#x6539;&#xFF1B;&#x5C0F;&#x516C;&#x53F8;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x6216;&#x8005;&#x8BBE;&#x8BA1;&#x5E08;&#x6765;&#x4E3A;iOS&#x548C;Android&#x5404;&#x51FA;&#x4E00;&#x5957;&#x8BBE;&#x8BA1;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x662F;&#x6709;&#x5F88;&#x591A;app&#x957F;&#x5F97;&#x50CF;&#x82F9;&#x679C;&#x3002;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#x4F55;&#x65F6;&#x624D;&#x80FD;&#x5230;&#x5C3D;&#x5934;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x9762;&#x5BF9;&#x5982;&#x6B64;&#x96BE;&#x63A7;&#x7684;&#x573A;&#x9762;&#xFF0C;Google&#x8FD8;&#x662F;&#x5927;&#x80C6;&#x5730;&#x53BB;&#x505A;&#x4E86;&#xFF0C;&#x7ED9;&#x51FA;&#x4E86;Material Design&#x89C4;&#x8303;&#xFF0C;&#x5728;&#x65B0;&#x7684;&#x7CFB;&#x7EDF;&#x5347;&#x7EA7;&#x4E2D;&#xFF0C;&#x4E5F;&#x9010;&#x6E10;&#x5730;&#x5F00;&#x59CB;&#x638C;&#x63A7;&#x4E3B;&#x52A8;&#x6743;&#xFF0C;&#x6BD4;&#x5982;Android 6.0&#x7684;&#x52A8;&#x6001;&#x6743;&#x9650;&#xFF0C;Android 7.0&#x79C1;&#x6709;&#x6587;&#x4EF6;&#x6743;&#x9650;&#x63A7;&#x5236;&#x7B49;&#x7B49;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;Google&#x5728;&#x52AA;&#x529B;&#x7740;&#xFF0C;&#x4E0D;&#x7BA1;&#x4E4B;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x4F1A;&#x662F;&#x600E;&#x6837;&#x3002;</p>
<p>&#x800C;&#x6700;&#x8FD1;&#x4E24;&#x5929;&#x6BD4;&#x8F83;&#x70ED;&#x95F9;&#x7684;&#x4E00;&#x4E2A;&#x8BDD;&#x9898;&#x4FBF;&#x662F;&#x5FAE;&#x4FE1;&#x7684;&#x5C0F;&#x7A0B;&#x5E8F;&#x3002;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x6211;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x592A;&#x61C2;&#x5F20;&#x5C0F;&#x9F99;&#x5927;&#x5E08;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x5C0F;&#x7A0B;&#x5E8F;&#x5728;&#x5FAE;&#x4FE1;&#x4E2D;&#x597D;&#x50CF;&#x6CA1;&#x6709;&#x5165;&#x53E3;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x57FA;&#x4E8E;&#x7EBF;&#x4E0B;&#x7684;&#x626B;&#x63CF;&#xFF0C;&#x7528;&#x5B8C;&#x5C31;&#x8D70;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x8C8C;&#x4F3C;&#x6709;&#x70B9;&#x53CD;&#x4E3B;&#x6D41;&#x3002;&#x56E0;&#x4E3A;&#x4E4B;&#x524D;&#x7684;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x7528;&#x6237;&#x548C;&#x6D41;&#x91CF;&#x662F;&#x5173;&#x952E;&#xFF0C;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x7528;&#x6237;&#x7528;&#x5B8C;&#x5C31;&#x8DD1;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x7559;&#x4E0B;&#x7528;&#x6237;&#x7684;&#x4EFB;&#x4F55;&#x4EF7;&#x503C;&#xFF0C;&#x611F;&#x89C9;&#x4E0D;&#x503C;&#x554A;&#x3002;&#x8FD9;&#x548C;&#x6211;&#x4EEC;&#x7528;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x626B;&#x4E00;&#x626B;&#x53BB;&#x626B;&#x63CF;&#x4E00;&#x4E0B;&#x4E8C;&#x7EF4;&#x7801;&#xFF0C;&#x5546;&#x5BB6;&#x901A;&#x8FC7;H5&#x6765;&#x5F00;&#x53D1;&#x4E00;&#x4E9B;&#x5408;&#x9002;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x7136;&#x540E;&#x63A5;&#x5165;&#x5FAE;&#x4FE1;&#xFF0C;&#x6709;&#x5565;&#x533A;&#x522B;&#x5462;&#x3002;&#x603B;&#x7ED3;&#x4F1A;&#x4E0A;&#x4E3E;&#x4E86;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x8BF4;&#xFF0C;&#x901A;&#x8FC7;&#x626B;&#x63CF;&#x516C;&#x4EA4;&#x8F66;&#x7AD9;&#x7684;&#x4E8C;&#x7EF4;&#x7801;&#x6765;&#x83B7;&#x53D6;&#x8BE5;&#x7AD9;&#x516C;&#x4EA4;&#x8F66;&#x5230;&#x8FBE;&#x7684;&#x65F6;&#x523B;&#x8868;&#xFF0C;&#x53EF;&#x662F;&#x9488;&#x5BF9;&#x8FD9;&#x79CD;&#x573A;&#x666F;&#xFF0C;&#x6211;&#x4E5F;&#x8BB8;&#x8FD8;&#x662F;&#x613F;&#x610F;&#x7528;&#x8F66;&#x6765;&#x4E86;&#x8FD9;&#x4E2A;App&#x63D0;&#x524D;&#x83B7;&#x53D6;&#x5230;&#x516C;&#x4EA4;&#x8F66;&#x5230;&#x8FBE;&#x65F6;&#x95F4;&#xFF0C;&#x907F;&#x514D;&#x65E9;&#x5230;&#x516C;&#x4EA4;&#x8F66;&#x7AD9;&#x7B49;&#x5F85;&#x7684;&#x5C34;&#x5C2C;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5FAE;&#x4FE1;&#x5750;&#x62E5;&#x8FD9;&#x4E48;&#x5927;&#x7684;&#x7528;&#x6237;&#x91CF;&#xFF0C;&#x4E00;&#x65E6;&#x5C0F;&#x7A0B;&#x5E8F;&#x706B;&#x4E86;&#xFF0C;&#x6CA1;&#x4EBA;&#x4E0B;&#x8F7D;App&#x65F6;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x4F1A;&#x5A01;&#x80C1;&#x5230;&#x82F9;&#x679C;&#x5546;&#x5E97;&#x7684;&#x4E00;&#x4E9B;&#x5229;&#x76CA;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C31;&#x4E0D;&#x5F97;&#x800C;&#x77E5;&#x4E86;&#x3002;&#x6BD5;&#x7ADF;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x4E2A;&#x4EBA;&#x7684;&#x778E;&#x60F3;&#xFF0C;&#x5728;1&#x6708;9&#x53F7;&#x6765;&#x5230;&#x4E4B;&#x524D;&#xFF0C;&#x662F;&#x65E0;&#x6CD5;&#x77E5;&#x9053;&#x5C0F;&#x7A0B;&#x5E8F;&#x7A76;&#x7ADF;&#x662F;&#x600E;&#x6837;&#x7684;&#x3002;&#x4EE5;&#x4E0A;&#x7EAF;&#x5C5E;&#x4E2A;&#x4EBA;&#x778E;&#x63B0;&#xFF0C;&#x5982;&#x6709;&#x4E0D;&#x59A5;&#xFF0C;&#x5C31;&#x5F53;&#x7B11;&#x8BDD;&#x4E00;&#x7B11;&#x800C;&#x8FC7;&#x5427;&#x3002;</p>
<h2 id="&#x7ED3;&#x679C;"><a href="#&#x7ED3;&#x679C;" class="headerlink" title="&#x7ED3;&#x679C;"></a>&#x7ED3;&#x679C;</h2><p>&#x76F8;&#x4FE1;&#x5728;&#x5C0F;&#x7A0B;&#x5E8F;&#x95EE;&#x4E16;&#x4E4B;&#x524D;&#xFF0C;&#x5FAE;&#x4FE1;&#x56E2;&#x961F;&#x4E5F;&#x4E0D;&#x4F1A;&#x77E5;&#x9053;&#x6700;&#x7EC8;&#x4F1A;&#x600E;&#x6837;&#xFF0C;&#x5C31;&#x50CF;&#x652F;&#x4ED8;&#x5B9D;&#x524D;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x5708;&#x5B50;&#x4E8B;&#x4EF6;&#xFF0C;&#x6CA1;&#x60F3;&#x5230;&#x4F1A;&#x5F15;&#x8D77;&#x8FD9;&#x4E48;&#x5927;&#x7684;&#x793E;&#x4F1A;&#x8BAE;&#x8BBA;&#x3002;&#x6240;&#x4EE5;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x53EA;&#x6709;&#x52C7;&#x6562;&#x5730;&#x53BB;&#x505A;&#x4E86;&#x624D;&#x77E5;&#x9053;&#x7ED3;&#x679C;&#x4F1A;&#x600E;&#x6837;&#xFF0C;&#x6210;&#x529F;&#x56FA;&#x7136;&#x53EF;&#x559C;&#xFF0C;&#x5931;&#x8D25;&#x4E5F;&#x7B97;&#x662F;&#x4E3A;&#x4E0B;&#x6B21;&#x52AA;&#x529B;&#x79EF;&#x7D2F;&#x7ECF;&#x9A8C;&#x7F62;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5C0F;&#x7A0B;&#x5E8F;&#x51FA;&#x6765;&#x4E4B;&#x540E;&#xFF0C;&#x81EA;&#x5DF1;&#x4E5F;&#x4F1A;&#x53BB;&#x5199;&#x4E2A;&#x5C0F;&#x4E1C;&#x897F;&#x73A9;&#x4E00;&#x73A9;&#xFF0C;&#x6BD5;&#x7ADF;&#x5B66;&#x4E60;&#x662F;&#x503C;&#x5F97;&#x9F13;&#x52B1;&#x7684;&#x3002;</p>
<p>&#x6839;&#x636E;&#x5C0F;&#x5B66;&#x4F5C;&#x6587;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x5E94;&#x8BE5;&#x518D;&#x6765;&#x4E00;&#x6BB5;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x5168;&#x6587;&#x3002;&#x4E0D;&#x8BBA;&#x662F;&#x5199;&#x4EE3;&#x7801;&#x8FD8;&#x597D;&#xFF0C;&#x8FD8;&#x662F;&#x505A;&#x4EA7;&#x54C1;&#x4E5F;&#x7F62;&#xFF0C;&#x4EA6;&#x6216;&#x662F;&#x751F;&#x6D3B;&#x4E2D;&#x7684;&#x70B9;&#x70B9;&#x6EF4;&#x6EF4;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x6709;&#x52C7;&#x6562;&#x5730;&#x53BB;&#x505A;&#x4E86;&#xFF0C;&#x624D;&#x4F1A;&#x77E5;&#x9053;&#x7ED3;&#x679C;&#x662F;&#x600E;&#x6837;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x4E0D;&#x505A;&#xFF0C;&#x673A;&#x4F1A;&#x5C31;&#x6E9C;&#x4E86;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x53EA;&#x662F;&#x9057;&#x61BE;&#x3002;</p>

      
    </div>
    
    <div>
      
        
      
    </div>

    <div>
      
        
      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/有意思的东西/" rel="tag">#有意思的东西</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/12/25/设计模式之享元模式/" rel="next" title="设计模式之享元模式">
                <i class="fa fa-chevron-left"></i> 设计模式之享元模式
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/01/15/Android Splash页面优雅跳转方案/" rel="prev" title="Android Splash页面优雅跳转方案">
                Android Splash页面优雅跳转方案 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/12/30/有些事只有勇敢地去做了才知道结果会怎样/"
           data-title="有些事只有勇敢地去做了才知道结果会怎样" data-url="http://yoursite.com/2016/12/30/有些事只有勇敢地去做了才知道结果会怎样/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            Table of Contents
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            Overview
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/uploads/avatar.png"
               alt="zhuimengfb" />
          <p class="site-author-name" itemprop="name">zhuimengfb</p>
          <p class="site-description motion-element" itemprop="description">微信公众号zhuimengfbi同步更新，欢迎关注</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">27</span>
              <span class="site-state-item-name">posts</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">4</span>
                <span class="site-state-item-name">tags</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#起因"><span class="nav-number">1.</span> <span class="nav-text">起因</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#经过"><span class="nav-number">2.</span> <span class="nav-text">经过</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#结果"><span class="nav-number">3.</span> <span class="nav-text">结果</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">zhuimengfb</span>
</div>

<div class="powered-by">
  Powered by <a class="theme-link" href="http://hexo.io">Hexo</a>
</div>

<div class="theme-info">
  Theme -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Muse
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"zhuimengfbblog"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  
  

  

  

</body>
</html>
