<!doctype html>



  


<html class="theme-next muse use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  




<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="title: &amp;#x8FD9;&amp;#x4E9B;&amp;#x5E74;&amp;#x770B;&amp;#x8FC7;&amp;#x4EE5;&amp;#x53CA;&amp;#x5373;&amp;#x5C06;&amp;#x8981;&amp;#x770B;&amp;#x7684;&amp;#x4E66;
tag: &amp;#x6742;&amp;#x4E03;&amp;#x6742;&amp;#x516B;&amp;#x56DE;&amp;#x60F3;&amp;#x4E00;&amp;#x4E0B;&amp;#xFF0C;&amp;#x4E0A;&amp;#">
<meta property="og:type" content="article">
<meta property="og:title" content="zhuimengfb's blog">
<meta property="og:url" content="http://yoursite.com/2017/06/04/这些年看过的以及即将要看的书/index.html">
<meta property="og:site_name" content="zhuimengfb's blog">
<meta property="og:description" content="title: &amp;#x8FD9;&amp;#x4E9B;&amp;#x5E74;&amp;#x770B;&amp;#x8FC7;&amp;#x4EE5;&amp;#x53CA;&amp;#x5373;&amp;#x5C06;&amp;#x8981;&amp;#x770B;&amp;#x7684;&amp;#x4E66;
tag: &amp;#x6742;&amp;#x4E03;&amp;#x6742;&amp;#x516B;&amp;#x56DE;&amp;#x60F3;&amp;#x4E00;&amp;#x4E0B;&amp;#xFF0C;&amp;#x4E0A;&amp;#">
<meta property="og:image" content="http://oe9xsykvg.bkt.clouddn.com/blog/zhuimengfb/Android.png">
<meta property="og:image" content="http://oe9xsykvg.bkt.clouddn.com/java.png">
<meta property="og:image" content="http://oe9xsykvg.bkt.clouddn.com/blog/zhuimengfb/Java%20Web.png">
<meta property="og:image" content="http://oe9xsykvg.bkt.clouddn.com/blog/zhuimengfb/timg.jpg">
<meta property="og:image" content="http://oe9xsykvg.bkt.clouddn.com/blog/zhuimengfb/coding.png">
<meta property="og:image" content="http://oe9xsykvg.bkt.clouddn.com/blog/zhuimengfb/books.png">
<meta property="og:updated_time" content="2017-06-04T12:14:18.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="zhuimengfb's blog">
<meta name="twitter:description" content="title: &amp;#x8FD9;&amp;#x4E9B;&amp;#x5E74;&amp;#x770B;&amp;#x8FC7;&amp;#x4EE5;&amp;#x53CA;&amp;#x5373;&amp;#x5C06;&amp;#x8981;&amp;#x770B;&amp;#x7684;&amp;#x4E66;
tag: &amp;#x6742;&amp;#x4E03;&amp;#x6742;&amp;#x516B;&amp;#x56DE;&amp;#x60F3;&amp;#x4E00;&amp;#x4E0B;&amp;#xFF0C;&amp;#x4E0A;&amp;#">
<meta name="twitter:image" content="http://oe9xsykvg.bkt.clouddn.com/blog/zhuimengfb/Android.png">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Muse',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: 'Author'
    }
  };
</script>

  <title>  | zhuimengfb's blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="en">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?32cc932d4c165744315fa3da1f8a235a";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">zhuimengfb's blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            Home
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            Archives
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            Tags
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">Posted on</span>
            <time itemprop="dateCreated" datetime="2017-06-04T20:12:51+08:00" content="2017-06-04">
              2017-06-04
            </time>
          </span>

          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2017/06/04/这些年看过的以及即将要看的书/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2017/06/04/这些年看过的以及即将要看的书/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <hr>
<p>title: &#x8FD9;&#x4E9B;&#x5E74;&#x770B;&#x8FC7;&#x4EE5;&#x53CA;&#x5373;&#x5C06;&#x8981;&#x770B;&#x7684;&#x4E66;</p>
<h2 id="tag-&#x6742;&#x4E03;&#x6742;&#x516B;"><a href="#tag-&#x6742;&#x4E03;&#x6742;&#x516B;" class="headerlink" title="tag: &#x6742;&#x4E03;&#x6742;&#x516B;"></a>tag: &#x6742;&#x4E03;&#x6742;&#x516B;</h2><p>&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x4E0A;&#x4E00;&#x7BC7;blog&#x5927;&#x6982;&#x5DF2;&#x7ECF;&#x662F;&#x4E00;&#x4E2A;&#x6708;&#x524D;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#xFF0C;&#x524D;&#x4E9B;&#x5929;&#x6709;&#x540C;&#x5B66;&#x7ED9;&#x6211;&#x8BF4;&#x9053;&#x4F60;&#x7684;&#x516C;&#x4F17;&#x53F7;&#x5DF2;&#x7ECF;&#x5F88;&#x4E45;&#x6CA1;&#x66F4;&#x65B0;&#x4E86;&#xFF0C;&#x624D;&#x5E61;&#x7136;&#x9192;&#x609F;&#xFF0C;&#x516C;&#x4F17;&#x53F7;&#x4E5F;&#x5DF2;&#x7ECF;&#x5F88;&#x4E45;&#x6CA1;&#x66F4;&#x65B0;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x8FD8;&#x662F;&#x8981;&#x5199;&#x70B9;&#x4E1C;&#x897F;&#xFF0C;&#x4E4B;&#x524D;&#x6709;&#x540C;&#x5B66;&#x5EFA;&#x8BAE;&#x8BF4;&#x80FD;&#x4E0D;&#x80FD;&#x5199;&#x70B9;&#x770B;&#x5F97;&#x61C2;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x53EF;&#x662F;&#x4E0D;&#x5199;&#x6280;&#x672F;&#x7C7B;&#x6587;&#x7AE0;&#x4E0D;&#x662F;&#x6211;&#x7684;&#x98CE;&#x683C;&#xFF08;&#x4E3B;&#x8981;&#x6211;&#x4E0D;&#x4F1A;&#x5199;&#x5176;&#x4ED6;&#x7684;&#xFF0C;&#x6211;&#x4E5F;&#x5F88;&#x7EDD;&#x671B;&#x554A;&#xFF09;&#x3002;&#x54C8;&#x54C8;&#x54C8;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x5199;&#x5199;&#x8FD9;&#x4E9B;&#x5E74;&#x770B;&#x8FC7;&#x7684;&#x4E66;&#x7C4D;&#x5427;&#xFF0C;&#x987A;&#x4FBF;&#x7ED9;&#x7ED9;&#x5B89;&#x5229;&#x3002;</p>
<a id="more"></a>
<h2 id="Android&#x7CFB;&#x5217;"><a href="#Android&#x7CFB;&#x5217;" class="headerlink" title="Android&#x7CFB;&#x5217;"></a>Android&#x7CFB;&#x5217;</h2><p>&#x5176;&#x5B9E;&#x8EAB;&#x8FB9;&#x597D;&#x591A;&#x540C;&#x5B66;&#x90FD;&#x4E0D;&#x89E3;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x8981;&#x653E;&#x5F03;Android&#xFF0C;&#x8F6C;&#x6218;&#x540E;&#x53F0;&#x5F00;&#x53D1;&#x3002;&#x54C8;&#x54C8;&#x54C8;&#xFF0C;&#x81F3;&#x4E8E;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x561B;&#xFF0C;&#x7B54;&#x6848;&#x53EF;&#x80FD;&#x4EC5;&#x4EC5;&#x662F;&#x56E0;&#x4E3A;&#x7EAF;&#x7CB9;&#x7684;&#x597D;&#x73A9;&#x513F;&#x5427;&#x3002;&#x5B9E;&#x4E60;&#x561B;&#xFF0C;&#x5C31;&#x662F;&#x6311;&#x6218;&#x81EA;&#x5DF1;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x9009;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x719F;&#x6089;&#x7684;&#x5C97;&#x4F4D;&#xFF0C;&#x4E5F;&#x8BB8;&#x80FD;&#x5B66;&#x5230;&#x66F4;&#x591A;&#x4E1C;&#x897F;&#x561B;&#x3002;&#x56DE;&#x60F3;&#x5B66;&#x4E60;Android&#x4E00;&#x8DEF;&#x8D70;&#x6765;&#xFF0C;&#x4E5F;&#x770B;&#x4E86;&#x5F88;&#x591A;&#x4E66;&#x7C4D;&#x3002;&#x7EB8;&#x8D28;&#x4E66;&#x7C4D;&#x770B;&#x8D77;&#x6765;&#x6709;&#x70B9;&#x7D2F;&#xFF0C;&#x6240;&#x4EE5;&#x9664;&#x4E86;&#x4E70;&#x4E86;&#x51E0;&#x672C;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x4E66;&#x7C4D;&#xFF0C;&#x5176;&#x4F59;&#x90FD;&#x662F;&#x770B;&#x7684;&#x7535;&#x5B50;&#x7248;&#x7684;&#x3002;</p>
<p><img src="http://oe9xsykvg.bkt.clouddn.com/blog/zhuimengfb/Android.png" alt=""></p>
<p>&#x5176;&#x5B9E;&#x5BF9;&#x4E8E;Android&#x7684;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x73B0;&#x5728;&#x8FD8;&#x6709;&#x6CA1;&#x6709;&#x540C;&#x5B66;&#x60F3;&#x5B66;&#x4E60;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x6BD5;&#x7ADF;Google&#x6B63;&#x5728;&#x7814;&#x53D1;&#x65B0;&#x7684;&#x79FB;&#x52A8;&#x7AEF;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x5929;&#x77E5;&#x9053;&#x5565;&#x65F6;&#x5019;Android&#x5C31;&#x6CA1;&#x6709;&#x672A;&#x6765;&#x4E86;&#x3002;&#x524D;&#x4E9B;&#x5929;&#x7684;I/O&#x5927;&#x4F1A;&#xFF0C;Google&#x5BA3;&#x5E03;&#x5B98;&#x65B9;&#x652F;&#x6301;Kotlin&#x6765;&#x5F00;&#x53D1;Android&#x5E94;&#x7528;&#xFF0C;&#x76F8;&#x6BD4;&#x4E8E;Java&#x6765;&#x8BF4;&#xFF0C;&#x5F00;&#x53D1;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#x3002;&#x4E0D;&#x8FC7;&#x6574;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;Android&#x5F00;&#x53D1;&#x601D;&#x8DEF;&#x90FD;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x8981;&#x638C;&#x63E1;&#x7684;&#x4F9D;&#x7136;&#x662F;&#x90A3;&#x4E9B;&#x77E5;&#x8BC6;&#x70B9;&#x3002;&#x5BF9;&#x4E8E;&#x57FA;&#x672C;&#x7684;Android&#x5F00;&#x53D1;&#xFF0C;UI&#x3001;&#x56DB;&#x5927;&#x7EC4;&#x4EF6;&#x3001;&#x7F51;&#x7EDC;&#x3001;&#x591A;&#x7EBF;&#x7A0B;&#x3001;&#x6D88;&#x606F;&#x673A;&#x5236;&#x3001;&#x89E6;&#x6478;&#x4E8B;&#x4EF6;&#x7B49;&#x4F9D;&#x7136;&#x662F;&#x5FC5;&#x987B;&#x8981;&#x638C;&#x63E1;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x66F4;&#x4E0A;&#x4E00;&#x5C42;&#x697C;&#x7684;&#x8BDD;&#xFF0C;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;&#x3001;&#x70ED;&#x66F4;&#x65B0;&#x3001;NDK&#x5F00;&#x53D1;&#x7B49;&#x77E5;&#x8BC6;&#x53EF;&#x4EE5;&#x597D;&#x597D;&#x5B66;&#x5B66;&#x3002;&#x54C8;&#xFF0C;&#x4E0B;&#x9762;&#x662F;&#x91CD;&#x70B9;&#x63A8;&#x8350;&#x3002;</p>
<ul>
<li>Android&#x5165;&#x95E8;&#xFF1A;&#x7B2C;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x3001;&#x7B2C;&#x4E8C;&#x884C;&#x4EE3;&#x7801;&#x3002;&#x90ED;&#x9716;&#x5927;&#x795E;&#x7684;&#x4E66;&#x7C4D;&#x5BF9;&#x4E8E;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x4ECB;&#x7ECD;&#x5F97;&#x5F88;&#x5168;&#x9762;&#xFF0C;&#x4E5F;&#x5F88;&#x8BE6;&#x7EC6;&#xFF0C;&#x4F5C;&#x4E3A;&#x5165;&#x95E8;&#x4E66;&#x7C4D;&#x6765;&#x8BF4;&#x5F88;&#x5408;&#x9002;&#x3002;</li>
<li>Android&#x8FDB;&#x9636;&#xFF1A;Android&#x5F00;&#x53D1;&#x827A;&#x672F;&#x63A2;&#x7D22;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x56CA;&#x62EC;&#x4E86;Android&#x8FDB;&#x9636;&#x9700;&#x8981;&#x638C;&#x63E1;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x5305;&#x62EC;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;&#x3001;View&#x76F8;&#x5173;&#x7684;&#x4E8B;&#x4EF6;&#x4F53;&#x7CFB;&#x3001;Android&#x6D88;&#x606F;&#x673A;&#x5236;&#x7B49;&#x7B49;&#xFF0C;&#x4F5C;&#x4E3A;&#x8FDB;&#x9636;&#x5FC5;&#x5907;&#x3002;</li>
<li>Android&#x9AD8;&#x7EA7;&#xFF1A;&#x63A8;&#x8350;&#x8001;&#x7F57;&#x7684;Android&#x7CFB;&#x7EDF;&#x6E90;&#x4EE3;&#x7801;&#x60C5;&#x666F;&#x5206;&#x6790;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x4E3B;&#x8981;&#x4ECE;Android&#x7CFB;&#x7EDF;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#x6765;&#x5206;&#x6790;Android&#x7684;&#x5404;&#x4E2A;&#x6838;&#x5FC3;&#x6A21;&#x5757;&#xFF0C;&#x8BB2;&#x5F97;&#x5F88;&#x8BE6;&#x7EC6;&#xFF0C;&#x7531;&#x4E8E;&#x4E2A;&#x4EBA;&#x6C34;&#x5E73;&#x6709;&#x9650;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x4EC5;&#x4EC5;&#x770B;&#x4E86;&#x90E8;&#x5206;&#x5C31;&#x653E;&#x5F03;&#x4E86;&#xFF0C;&#x5B9E;&#x5728;&#x592A;&#x96BE;&#x4E86;&#x3002;</li>
<li>&#x6742;&#x4E03;&#x6742;&#x516B;&#xFF1A;&#x4E66;&#x5355;&#x91CC;&#x9762;&#x6709;&#x5199;&#x6742;&#x4E03;&#x6742;&#x516B;&#x7684;&#x4E66;&#x5176;&#x5B9E;&#x5F88;&#x4E0D;&#x9519;&#xFF0C;&#x6BD4;&#x5982;Android&#x5F00;&#x53D1;&#x5FC5;&#x77E5;&#x7684;50&#x4E2A;&#x8BC0;&#x7A8D;&#xFF0C;&#x4ECB;&#x7ECD;&#x4E86;50&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x8DA3;&#x5E76;&#x4E14;&#x5B9E;&#x7528;&#x7684;&#x5F00;&#x53D1;&#x6280;&#x5DE7;&#x3002;App&#x7814;&#x53D1;&#x5F55;&#x540C;&#x6837;&#x4E5F;&#x4ECE;&#x5F00;&#x53D1;&#x5E94;&#x7528;&#x7684;&#x89D2;&#x5EA6;&#x4ECB;&#x7ECD;&#x4E86;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;App&#x9700;&#x8981;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x6BD4;&#x5982;&#x7ADE;&#x54C1;&#x5206;&#x6790;&#x3001;&#x6301;&#x7EED;&#x96C6;&#x6210;&#x3001;&#x70ED;&#x66F4;&#x65B0;&#x7B49;&#x3002;&#x8FD9;&#x4E24;&#x672C;&#x4E66;&#x90FD;&#x633A;&#x6709;&#x610F;&#x601D;&#x7684;&#xFF0C;&#x5EFA;&#x8BAE;&#x770B;&#x770B;&#x3002;</li>
<li>&#x5DE5;&#x5177;&#xFF1A;&#x5DE5;&#x6B32;&#x5584;&#x5176;&#x4E8B;&#x5FC5;&#x5148;&#x5229;&#x5176;&#x5668;&#xFF0C;Android&#x5F00;&#x53D1;&#x4F7F;&#x7528;&#x7684;IDE&#x4ECE;&#x6700;&#x521D;&#x7684;eclipse&#x8FC7;&#x6E21;&#x5230;&#x73B0;&#x5728;&#x7684;Android Studio&#xFF0C;&#x5F00;&#x53D1;&#x6548;&#x7387;&#x5927;&#x5927;&#x589E;&#x52A0;&#x4E86;&#xFF0C;&#x4F46;&#x524D;&#x63D0;&#x662F;&#x8981;&#x719F;&#x6089;Android Studio&#x8FD9;&#x4E2A;&#x6BD4;&#x8F83;&#x65B0;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x6240;&#x6709;&#x8981;&#x597D;&#x597D;&#x5B66;&#x4E60;&#x600E;&#x4E48;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;Android Studio&#x5B9E;&#x6218;&#x4EE5;&#x53CA;Android&#x7FA4;&#x82F1;&#x4F20;&#x90FD;&#x4ECB;&#x7ECD;&#x4E86;&#x600E;&#x4E48;&#x9AD8;&#x6548;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x5148;&#x8FDB;&#x7684;&#x6B66;&#x5668;&#xFF0C;&#x503C;&#x5F97;&#x770B;&#x770B;&#x3002;</li>
</ul>
<p>&#x6CA1;&#x6709;&#x5B9E;&#x8DF5;&#x7684;&#x77E5;&#x8BC6;&#x90FD;&#x53EA;&#x80FD;&#x7B97;&#x662F;&#x7EB8;&#x4E0A;&#x8C08;&#x5175;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x6709;&#x4E86;&#x7406;&#x8BBA;&#x57FA;&#x7840;&#x4E4B;&#x540E;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x53BB;&#x5F00;&#x53D1;&#x5E94;&#x7528;&#x3002;&#x5199;&#x7B2C;&#x4E09;&#x65B9;&#x5FAE;&#x535A;&#x4E5F;&#x597D;&#xFF0C;&#x5199;&#x5929;&#x6C14;&#x7B49;&#x5C0F;&#x5E94;&#x7528;&#x90FD;&#x884C;&#xFF0C;&#x5229;&#x7528;&#x7F51;&#x4E0A;&#x7684;&#x5F00;&#x653E;Api&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x505A;&#x5F88;&#x591A;&#x6709;&#x610F;&#x601D;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x53EA;&#x6709;&#x771F;&#x6B63;&#x5199;&#x4E86;&#x5E94;&#x7528;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x624D;&#x4F1A;&#x53D1;&#x73B0;&#x77E5;&#x8BC6;&#x7684;&#x771F;&#x5B9E;&#x6027;&#x3002;</p>
<h2 id="Java&#x7CFB;&#x5217;"><a href="#Java&#x7CFB;&#x5217;" class="headerlink" title="Java&#x7CFB;&#x5217;"></a>Java&#x7CFB;&#x5217;</h2><p>&#x5176;&#x5B9E;&#x63A5;&#x89E6;&#x7684;&#x7B2C;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x5E76;&#x4E0D;&#x662F;Java&#xFF0C;&#x4F46;&#x5374;&#x88AB;Java&#x6DF1;&#x6DF1;&#x5730;&#x5438;&#x5F15;&#x4E86;&#xFF08;&#x4E3B;&#x8981;&#x662F;&#x7B80;&#x5355;&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x540E;&#x9762;&#x5F00;&#x59CB;&#x6162;&#x6162;&#x81EA;&#x5B66;&#xFF0C;&#x6700;&#x5F00;&#x59CB;&#x4ECE;&#x56FE;&#x4E66;&#x9986;&#x501F;&#x4E66;&#xFF0C;&#x8FB9;&#x770B;&#x8FB9;&#x6572;&#x4EE3;&#x7801;&#xFF0C;&#x5176;&#x5B9E;&#x6700;&#x5F00;&#x59CB;&#x6839;&#x672C;&#x4E0D;&#x61C2;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5C31;&#x4F53;&#x73B0;&#x51FA;&#x591A;&#x6001;&#x6027;&#x4E86;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x901A;&#x8FC7;socket&#x5C31;&#x5B9E;&#x73B0;&#x4E86;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x901A;&#x4FE1;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5C31;&#x53CD;&#x5C04;&#x4E86;&#xFF08;&#x5176;&#x5B9E;&#x73B0;&#x5728;&#x4E5F;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x61C2;&#xFF0C;&#x54C8;&#x54C8;&#x54C8;&#xFF09;&#xFF0C;&#x5F53;&#x65F6;&#x53EA;&#x77E5;&#x9053;&#x7167;&#x7740;&#x4E66;&#x4E0A;&#x7684;&#x4EE3;&#x7801;&#x6572;&#x5C31;&#x597D;&#x4E86;&#x3002;&#x4E8E;&#x662F;&#x968F;&#x7740;&#x6572;&#x7684;&#x4EE3;&#x7801;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x5BF9;Java&#x7684;&#x719F;&#x6089;&#x7A0B;&#x5EA6;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x9AD8;&#x3002;</p>
<p><img src="http://oe9xsykvg.bkt.clouddn.com/java.png" alt=""></p>
<p>&#x5176;&#x5B9E;&#x5BF9;&#x4E8E;Java&#x6765;&#x8BF4;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x4EC0;&#x4E48;21&#x5929;&#x4ECE;&#x5165;&#x95E8;&#x5230;&#x7CBE;&#x901A;&#x4E4B;&#x7C7B;&#x7684;&#x4E66;&#x7C4D;&#xFF0C;&#x5F53;&#x65F6;&#x50BB;&#x50BB;&#x7684;&#x81EA;&#x5DF1;&#x4E5F;&#x4ECE;&#x56FE;&#x4E66;&#x9986;&#x501F;&#x4E86;&#x5E76;&#x770B;&#x4E86;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x7C7B;&#x4E66;&#x5E76;&#x6CA1;&#x591A;&#x5927;&#x7528;&#x3002;&#x5176;&#x5B9E;&#x5BF9;&#x4E8E;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x57FA;&#x672C;&#x8BED;&#x6CD5;&#x90FD;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x968F;&#x4FBF;&#x627E;&#x4E00;&#x672C;&#x5373;&#x53EF;&#x3002;&#x5982;&#x679C;&#x6709;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x50CF;Java&#x6838;&#x5FC3;&#x5377;&#x8FD9;&#x7C7B;&#x7684;&#x4E66;&#x7C4D;&#x5C31;&#x5F88;&#x9002;&#x5408;&#x7528;&#x6765;&#x5B66;Java&#xFF0C;&#x5982;&#x679C;Java&#x662F;&#x4F60;&#x7B2C;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#xFF0C;&#x90A3;&#x5EFA;&#x8BAE;&#x5148;&#x770B;&#x770B;Head First Java&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x672C;&#x4E66;&#x8BB2;&#x5F97;&#x5B9E;&#x5728;&#x592A;&#x5F62;&#x8C61;&#x4E86;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x4E86;&#x89E3;&#x7F16;&#x7A0B;&#x53EF;&#x4EE5;&#x5E72;&#x561B;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x770B;Java&#x6838;&#x5FC3;&#x6280;&#x672F;&#x7B49;&#x6765;&#x719F;&#x6089;Java&#x7684;&#x5404;&#x79CD;&#x8BED;&#x6CD5;&#x3002;</p>
<p>&#x4F46;&#x5BF9;&#x4E8E;Java&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x8FD9;&#x53EA;&#x662F;&#x7B80;&#x7B80;&#x5355;&#x5355;&#x7684;&#x8BED;&#x8A00;&#x5B66;&#x4E60;&#xFF0C;&#x800C;Java&#x771F;&#x6B63;&#x5F3A;&#x5927;&#x7684;&#x662F;&#x5176;&#x5404;&#x79CD;&#x65B9;&#x5411;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x6BD4;&#x5982;Android&#x5F00;&#x53D1;&#xFF0C;Web&#x5F00;&#x53D1;&#xFF0C;&#x5927;&#x6570;&#x636E;&#x7B49;&#x3002;&#x4F46;&#x8FD9;&#x4E9B;&#x90FD;&#x5EFA;&#x7ACB;&#x5728;&#x5BF9;&#x4E8E;Java&#x865A;&#x62DF;&#x673A;&#x719F;&#x6089;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x4E8E;Java&#x600E;&#x4E48;&#x5EFA;&#x7ACB;&#x5BF9;&#x8C61;&#xFF0C;&#x600E;&#x4E48;&#x5206;&#x914D;&#x5185;&#x5B58;&#x7B49;&#x4E00;&#x65E0;&#x6240;&#x77E5;&#xFF0C;&#x90A3;&#x4F60;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x5165;Java&#x7684;&#x95E8;&#x3002;&#x6240;&#x4EE5;&#x300A;&#x6DF1;&#x5165;&#x7406;&#x89E3;Java&#x865A;&#x62DF;&#x673A;&#x300B;&#x8FD9;&#x672C;&#x4E66;&#x4E00;&#x5B9A;&#x8981;&#x770B;&#xFF0C;&#x5E76;&#x4E14;&#x4E00;&#x5B9A;&#x8981;&#x7406;&#x89E3;&#x3002;&#x4E86;&#x89E3;Java&#x7684;&#x5185;&#x5B58;&#x6A21;&#x578B;&#x3001;&#x4E86;&#x89E3;Java&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#x3001;&#x4E86;&#x89E3;Java&#x7684;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x3001;&#x4E86;&#x89E3;Java&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x673A;&#x5236;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x4F60;&#x5165;&#x95E8;Java&#x5FC5;&#x987B;&#x8981;&#x638C;&#x63E1;&#x7684;&#x77E5;&#x8BC6;&#x3002;</p>
<p>&#x7136;&#x540E;&#x66F4;&#x4E0A;&#x4E00;&#x5C42;&#xFF0C;&#x719F;&#x6089;Java&#x7684;&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x7684;&#x827A;&#x672F;&#xFF0C;&#x662F;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x8FDB;&#x9636;Java&#x5DE5;&#x7A0B;&#x5E08;&#x5FC5;&#x5907;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x5E76;&#x53D1;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x65E6;&#x5904;&#x7406;&#x4E0D;&#x597D;&#xFF0C;&#x8F7B;&#x5219;&#x964D;&#x4F4E;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#xFF0C;&#x4E25;&#x91CD;&#x7684;&#x76F4;&#x63A5;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x5D29;&#x6E83;&#x3002;&#x6240;&#x4EE5;&#x5B66;&#x4E60;&#x597D;Java&#x5E76;&#x53D1;&#x7684;&#x77E5;&#x8BC6;&#x4E5F;&#x76F8;&#x5F53;&#x91CD;&#x8981;&#x3002;&#x5E76;&#x4E14;&#x73B0;&#x5B9E;&#x4E00;&#x70B9;&#xFF0C;&#x5728;&#x9762;&#x8BD5;&#x4E2D;&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x548C;&#x5E76;&#x53D1;&#x662F;&#x9762;Java&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#x5FC5;&#x987B;&#x8981;&#x9762;&#x5BF9;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x7136;&#x540E;Effective Java&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;Java&#x5B66;&#x4E60;&#x7684;&#x77E5;&#x8BC6;&#x8865;&#x5145;&#xFF0C;Effective&#x662F;&#x4E00;&#x4E2A;&#x7CFB;&#x5217;&#xFF0C;&#x4E5F;&#x6709;c++&#x7B49;&#xFF0C;&#x6240;&#x4EE5;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8BDD;&#x53EF;&#x4EE5;&#x8BFB;&#x4E00;&#x8BFB;&#x3002;</p>
<p>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x7F16;&#x7A0B;&#x601D;&#x60F3;&#xFF0C;&#x5BF9;&#x4E8E;&#x7F16;&#x7A0B;&#x80FD;&#x529B;&#x7684;&#x63D0;&#x9AD8;&#x662F;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x9762;&#x8BD5;&#x4E2D;&#x5982;&#x679C;&#x80FD;&#x591F;&#x5411;&#x9762;&#x8BD5;&#x5B98;&#x5C55;&#x793A;&#x81EA;&#x5DF1;&#x5BF9;&#x4E8E;&#x8FD9;&#x65B9;&#x9762;&#x77E5;&#x8BC6;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x662F;&#x6709;&#x5F88;&#x5927;&#x7684;&#x52A0;&#x5206;&#x7684;&#x3002;Head First&#x5165;&#x95E8;&#xFF0C;&#x518D;&#x5408;&#x9002;&#x4E0D;&#x8FC7;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x300A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;-&#x53EF;&#x590D;&#x7528;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8F6F;&#x4EF6;&#x7684;&#x57FA;&#x7840;&#x300B;&#x5F88;&#x5168;&#x9762;&#xFF0C;&#x4F46;&#x8BB2;&#x5F97;&#x6709;&#x70B9;&#x6666;&#x6DA9;&#xFF0C;&#x8BF7;&#x614E;&#x91CD;&#x9009;&#x62E9;&#x3002;&#x5982;&#x679C;&#x5BF9;Android&#x5F00;&#x53D1;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x90A3;&#x4E48;&#x300A;Android&#x6E90;&#x7801;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x89E3;&#x6790;&#x4E0E;&#x5B9E;&#x6218;&#x300B;&#x5C31;&#x5F88;&#x5408;&#x9002;&#x4E86;&#xFF0C;&#x65E2;&#x80FD;&#x719F;&#x6089;Android&#x77E5;&#x8BC6;&#xFF0C;&#x53C8;&#x80FD;&#x719F;&#x6089;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x4E00;&#x4E3E;&#x4E24;&#x5F97;&#x3002;</p>
<h2 id="Java-Web&#x7CFB;&#x5217;"><a href="#Java-Web&#x7CFB;&#x5217;" class="headerlink" title="Java Web&#x7CFB;&#x5217;"></a>Java Web&#x7CFB;&#x5217;</h2><p>&#x8FD9;&#x4E2A;&#x7CFB;&#x5217;&#x4E5F;&#x6B63;&#x662F;&#x81EA;&#x5DF1;&#x76EE;&#x524D;&#x6B63;&#x5728;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x4ECE;&#x5BF9;&#x4E8E;SSM&#x6846;&#x67B6;&#xFF08;Spring+SpringMVC+Mybatis)&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x5230;&#x5206;&#x5E03;&#x5F0F;&#x5904;&#x7406;&#x7B49;&#xFF0C;&#x9700;&#x8981;&#x7684;&#x53EA;&#x662F;&#x76F8;&#x5F53;&#x591A;&#xFF0C;&#x4E5F;&#x7ED9;&#x81EA;&#x5DF1;&#x51C6;&#x5907;&#x4E86;&#x4E00;&#x4EFD;&#x4E66;&#x5355;&#xFF0C;&#x4E89;&#x53D6;&#x80FD;&#x591F;&#x5C3D;&#x5FEB;&#x770B;&#x5B8C;&#x3001;&#x7406;&#x89E3;&#x5E76;&#x5B9E;&#x8DF5;&#x3002;</p>
<p><img src="http://oe9xsykvg.bkt.clouddn.com/blog/zhuimengfb/Java%20Web.png" alt=""></p>
<p>&#x67B6;&#x6784;&#x63A2;&#x9669;&#x548C;Spring in Action&#x5DF2;&#x7ECF;&#x770B;&#x4E86;&#x4E00;&#x904D;&#x4E86;&#xFF0C;&#x5176;&#x5B9E;&#x672C;&#x6765;&#x8FD9;&#x7BC7;blog&#x662F;&#x60F3;&#x5C06;&#x67B6;&#x6784;&#x63A2;&#x9669;&#x7684;&#x8BFB;&#x4E66;&#x7B14;&#x8BB0;&#x7684;&#xFF0C;&#x5373;&#x4ECE;&#x96F6;&#x6253;&#x9020;&#x4E00;&#x4E2A;Java Web&#x6846;&#x67B6;&#x9700;&#x8981;&#x5E72;&#x5565;&#xFF0C;&#x4F46;&#x5199;&#x7740;&#x5199;&#x7740;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#x8FD8;&#x662F;&#x4E0D;&#x591F;&#x6DF1;&#x5165;&#xFF0C;&#x6240;&#x4EE5;&#x4E34;&#x65F6;&#x5207;&#x6362;&#x6210;&#x4E66;&#x7C4D;&#x4ECB;&#x7ECD;&#x4E86;&#xFF0C;&#x4E0B;&#x4E00;&#x7BC7;&#x6765;&#x4ECB;&#x7ECD;&#x600E;&#x4E48;&#x6784;&#x5EFA;Java Web&#x6846;&#x67B6;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x8BF4;Java Web&#x662F;Java&#x5E94;&#x7528;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x4ECE;&#x65E9;&#x671F;&#x7684;Java EJB&#xFF0C;Java EE&#x5230;&#x540E;&#x6765;&#x7684;SSH&#xFF08;Struts+Spring+Hibernate)&#xFF0C;SSM&#x7B49;&#x6846;&#x67B6;&#xFF0C;Java Web&#x4E00;&#x76F4;&#x5728;&#x53D1;&#x5C55;&#x3002;&#x90A3;&#x4E48;&#x5BF9;&#x4E8E;&#x5B66;&#x4E60;Java Web&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x638C;&#x63E1;&#x54EA;&#x4E9B;&#x77E5;&#x8BC6;&#x5462;&#xFF1F;</p>
<ul>
<li>Java&#x8BED;&#x8A00;&#xFF0C;&#x8FD9;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#xFF0C;&#x6CA1;&#x6709;Java&#x8BED;&#x8A00;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x505A;Java Web&#x80AF;&#x5B9A;&#x662F;&#x4E0D;&#x884C;&#x7684;&#x3002;</li>
<li>&#x5BB9;&#x5668;&#xFF0C;Java Server&#x7684;&#x5BB9;&#x5668;&#x79CD;&#x7C7B;&#x4E5F;&#x633A;&#x591A;&#x7684;&#xFF0C;Tomcat&#x3001;Jetty&#x3001;Jboss&#x7B49;&#xFF0C;&#x4E0D;&#x8FC7;&#x597D;&#x50CF;&#x5927;&#x90E8;&#x5206;&#x516C;&#x53F8;&#x5305;&#x62EC;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x7B49;&#x90FD;&#x662F;&#x7528;&#x7684;Tomcat&#xFF0C;&#x6240;&#x4EE5;&#x638C;&#x63E1;Tomcat&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#xFF0C;&#x6027;&#x80FD;&#x8C03;&#x4F18;&#x7B49;&#x4E5F;&#x662F;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x3002;</li>
<li>&#x540E;&#x53F0;&#x670D;&#x52A1;&#x6846;&#x67B6;&#xFF0C;&#x76EE;&#x524D;&#x6765;&#x8BF4;&#xFF0C;Spring+SpringMVC+ORM&#x7684;&#x6846;&#x67B6;&#x5E94;&#x8BE5;&#x662F;&#x4E3B;&#x6D41;&#xFF0C;Spring&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x795E;&#x5947;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4ED6;&#x4E3A;&#x5F00;&#x53D1;&#x8005;&#x7701;&#x53BB;&#x4E86;&#x5F88;&#x591A;&#x4E8B;&#x513F;&#xFF0C;&#x4ED6;&#x7684;DI&#x548C;AOP&#x7279;&#x6027;&#x7B80;&#x76F4;&#x662F;&#x795E;&#x5668;&#x3002;&#x501F;&#x52A9;&#x8FD9;&#x5957;&#x6846;&#x67B6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7F16;&#x5199;Controller&#x6765;&#x5904;&#x7406;&#x76F8;&#x5E94;&#x7684;url&#x6620;&#x5C04;&#xFF0C;&#x7136;&#x540E;&#x7F16;&#x5199;Service&#x5904;&#x7406;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x518D;&#x901A;&#x8FC7;ORM&#x6846;&#x67B6;&#x5C06;&#x6570;&#x636E;&#x6301;&#x4E45;&#x5316;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;&#x76EE;&#x524D;&#x6D41;&#x884C;&#x7684;ORM&#x6709;Hibernate&#x3001;Mybatis&#x4EE5;&#x53CA;JPA&#xFF0C;Spring&#x90FD;&#x5BF9;&#x4ED6;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x652F;&#x6301;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x4EFB;&#x610F;&#x4E00;&#x79CD;&#x6846;&#x67B6;&#x6765;&#x4F7F;&#x7528;&#x3002;&#x7136;&#x540E;&#x4E2D;&#x95F4;&#x53EF;&#x80FD;&#x4F1A;&#x7528;&#x5230;Redis&#x8FD9;&#x79CD;&#x7F13;&#x5B58;&#x6846;&#x67B6;&#xFF0C;&#x4E0D;&#x8FC7;Spring&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x5BF9;&#x5176;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x7528;&#x8D77;&#x6765;&#x4E5F;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x3002;</li>
<li>&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x505A;&#x540E;&#x53F0;&#x5F00;&#x53D1;&#xFF0C;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x7684;&#x64CD;&#x4F5C;&#x4E5F;&#x5F97;&#x76F8;&#x5F53;&#x719F;&#x6089;&#xFF0C;&#x4F20;&#x7EDF;&#x7684;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x6BD4;&#x5982;Oracle&#x3001;MySQL&#x7B49;&#x603B;&#x5F97;&#x4F1A;&#x7528;&#x5427;&#xFF0C;&#x6BD5;&#x7ADF;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x8FD8;&#x662F;&#x73B0;&#x5728;&#x7684;&#x4E3B;&#x6D41;&#x3002;&#x7136;&#x540E;&#x6587;&#x6863;&#x578B;&#x6570;&#x636E;&#x5E93;MongoDB&#xFF0C;key-value&#x6570;&#x636E;&#x5E93;Redis&#x7B49;&#x90FD;&#x6709;&#x5176;&#x5E94;&#x7528;&#x573A;&#x666F;&#xFF0C;&#x4E5F;&#x5F97;&#x597D;&#x597D;&#x5B66;&#x4E00;&#x5B66;&#x3002;</li>
<li>&#x5228;&#x53BB;&#x4E1A;&#x52A1;&#x5C42;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x662F;&#x5F88;&#x591A;&#x7EAF;&#x6280;&#x672F;&#x7684;&#x4E1C;&#x897F;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x600E;&#x4E48;&#x53BB;&#x642D;&#x5EFA;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x670D;&#x52A1;&#x96C6;&#x7FA4;&#x6765;&#x652F;&#x6301;&#x66F4;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x600E;&#x4E48;&#x5728;&#x6709;&#x9AD8;&#x5E76;&#x53D1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x62B5;&#x6321;&#x5BF9;&#x670D;&#x52A1;&#x5668;&#x4E1A;&#x52A1;&#x53CA;&#x6570;&#x636E;&#x7684;&#x51B2;&#x51FB;&#x3002;&#x4EE5;&#x53CA;&#x5206;&#x5E03;&#x5F0F;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x600E;&#x4E48;&#x53BB;&#x5E73;&#x8861;CAP&#xFF08;Consistency&#x3001;Availability&#x548C;Partition tolerance&#xFF09;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x600E;&#x4E48;&#x53BB;&#x6784;&#x5EFA;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x6765;&#x63D0;&#x9AD8;&#x670D;&#x52A1;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7B49;&#x7B49;&#x3002;&#x8FD9;&#x90E8;&#x5206;&#x7684;&#x77E5;&#x8BC6;&#x4E0D;&#x4EC5;&#x591A;&#xFF0C;&#x8FD8;&#x5F88;&#x96BE;&#xFF08;&#x54ED;&#x7740;&#x4E5F;&#x8981;&#x770B;&#x4E0B;&#x53BB;&#xFF09;&#xFF01;</li>
</ul>
<h2 id="Coding"><a href="#Coding" class="headerlink" title="Coding"></a>Coding</h2><p>&#x5176;&#x5B9E;&#x7F16;&#x7A0B;&#x662F;&#x4E00;&#x95E8;&#x7EFC;&#x5408;&#x7684;&#x827A;&#x672F;&#xFF0C;&#x600E;&#x4E48;&#x628A;&#x4EE3;&#x7801;&#x5199;&#x5F97;&#x597D;&#x770B;&#xFF08;&#x5F53;&#x7136;&#x4E0D;&#x662F;&#x6307;&#x4E0B;&#x9762;&#x8FD9;&#x79CD;&#xFF09;&#xFF0C;&#x6240;&#x8C13;&#x597D;&#x770B;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x6307;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x9605;&#x8BFB;&#x6027;&#x5F88;&#x9AD8;&#xFF0C;&#x8BA9;&#x522B;&#x4EBA;&#x80FD;&#x591F;&#x4E00;&#x773C;&#x770B;&#x51FA;&#x4F60;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x662F;&#x5E72;&#x5565;&#x7684;&#x3002;<br><img src="http://oe9xsykvg.bkt.clouddn.com/blog/zhuimengfb/timg.jpg" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x62FF;&#x51FA;&#x4F60;&#x4E09;&#x4E2A;&#x6708;&#x524D;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x81EA;&#x5DF1;&#x8FD8;&#x80FD;&#x4E00;&#x773C;&#x5C31;&#x77E5;&#x9053;&#x67D0;&#x4E2A;&#x51FD;&#x6570;&#x662F;&#x5E72;&#x5565;&#x7684;&#xFF0C;&#x4E3A;&#x5565;&#x8981;&#x8FD9;&#x6837;&#x5199;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x8BF4;&#x660E;&#x5C31;&#x662F;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5BF9;&#x4E8E;Coding&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x6709;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#xFF0C;&#x5BF9;&#x4E8E;Java&#x6765;&#x8BF4;&#xFF0C;&#x963F;&#x91CC;&#x7684;Java&#x5F00;&#x53D1;&#x89C4;&#x8303;&#x662F;&#x4E00;&#x5B9A;&#x8981;&#x53BB;&#x770B;&#x5E76;&#x9075;&#x5B88;&#x7684;&#x3002;</p>
<p><img src="http://oe9xsykvg.bkt.clouddn.com/blog/zhuimengfb/coding.png" alt=""></p>
<p>&#x54C8;&#x54C8;&#xFF0C;&#x53D1;&#x73B0;&#x597D;&#x591A;&#x9762;&#x8BD5;&#x7684;&#x4E66;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x90FD;&#x6CA1;&#x600E;&#x4E48;&#x53BB;&#x770B;&#x3002;&#x91CC;&#x9762;&#x91CD;&#x70B9;&#x63A8;&#x8350;&#x4EE3;&#x7801;&#x5927;&#x5168;&#x3001;&#x4EE3;&#x7801;&#x6574;&#x6D01;&#x4E4B;&#x9053;&#x3001;&#x963F;&#x91CC;Java&#x5F00;&#x53D1;&#x624B;&#x518C;&#xFF0C;&#x4EE5;&#x53CA;&#x91CD;&#x6784;&#xFF0C;&#x6539;&#x5584;&#x65E2;&#x6709;&#x4EE3;&#x7801;&#x7684;&#x8BBE;&#x8BA1;&#x8FD9;&#x51E0;&#x672C;&#x4E66;&#x3002;&#x5176;&#x5B9E;&#x91CC;&#x9762;&#x90FD;&#x662F;&#x4E00;&#x4E9B;&#x5F88;&#x7EC6;&#x8282;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5173;&#x952E;&#x662F;&#x81EA;&#x5DF1;&#x5728;&#x5E73;&#x65F6;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#x80FD;&#x591F;&#x6CE8;&#x91CD;&#x8FD9;&#x4E9B;&#x7EC6;&#x8282;&#xFF0C;&#x5E76;&#x4E14;&#x9075;&#x5FAA;&#x8FD9;&#x4E9B;&#x7EC6;&#x8282;&#x3002;&#x6570;&#x5B66;&#x4E4B;&#x7F8E;&#x662F;&#x4E00;&#x95E8;&#x5F88;&#x6709;&#x8DA3;&#x7684;&#x4E66;&#xFF0C;&#x8BB0;&#x5F97;&#x5F53;&#x65F6;&#x662F;&#x5728;&#x706B;&#x8F66;&#x4E0A;&#x770B;&#x5B8C;&#x7684;&#xFF0C;&#x5434;&#x519B;&#x5927;&#x795E;&#x4ECE;&#x901A;&#x4FE1;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x89E3;&#x51B3;&#x4E86;&#x5F88;&#x591A;&#x8BA1;&#x7B97;&#x673A;&#x65B9;&#x9762;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x4ED6;&#x5F53;&#x521D;&#x5728;Google&#x7684;&#x5DE5;&#x4F5C;&#x7ECF;&#x5386;&#xFF0C;&#x8FD9;&#x4F4D;&#x5927;&#x795E;&#x8FD8;&#x6709;&#x6D6A;&#x6F6E;&#x4E4B;&#x5DC5;&#x3001;&#x6587;&#x660E;&#x4E4B;&#x5149;&#x7B49;&#x8457;&#x4F5C;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD8;&#x6CA1;&#x6765;&#x5F97;&#x53CA;&#x62DC;&#x8BFB;&#xFF0C;&#x5728;&#x95F2;&#x4E0B;&#x6765;&#x7684;&#x65F6;&#x5019;&#x8BFB;&#x4E00;&#x8BFB;&#x5BF9;&#x4E8E;&#x62D3;&#x5C55;&#x601D;&#x7EF4;&#x662F;&#x6709;&#x5F88;&#x5927;&#x5E2E;&#x52A9;&#x7684;&#x3002;</p>
<h2 id="&#x5728;&#x770B;&#x4E66;&#x7684;&#x8DEF;&#x4E0A;&#x8D8A;&#x8D70;&#x8D8A;&#x8FDC;"><a href="#&#x5728;&#x770B;&#x4E66;&#x7684;&#x8DEF;&#x4E0A;&#x8D8A;&#x8D70;&#x8D8A;&#x8FDC;" class="headerlink" title="&#x5728;&#x770B;&#x4E66;&#x7684;&#x8DEF;&#x4E0A;&#x8D8A;&#x8D70;&#x8D8A;&#x8FDC;"></a>&#x5728;&#x770B;&#x4E66;&#x7684;&#x8DEF;&#x4E0A;&#x8D8A;&#x8D70;&#x8D8A;&#x8FDC;</h2><p>&#x5176;&#x5B9E;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x540C;&#x5B66;&#x95EE;&#x6211;&#x559C;&#x4E0D;&#x559C;&#x6B22;&#x770B;&#x4E66;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x7684;&#x7B54;&#x6848;&#x662F;&#x5426;&#x5B9A;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x603B;&#x662F;&#x4E0D;&#x80FD;&#x628A;&#x8BFB;&#x4E66;&#x8FD9;&#x4E2A;&#x597D;&#x4E60;&#x60EF;&#x575A;&#x6301;&#x4E0B;&#x53BB;&#x3002;&#x8BB0;&#x5F97;&#x5FAE;&#x4FE1;&#x8BFB;&#x4E66;&#x7684;&#x4E66;&#x67B6;&#x4E0A;&#x6446;&#x4E86;&#x597D;&#x591A;&#x4E66;&#xFF0C;&#x4F46;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x4E5F;&#x53EA;&#x770B;&#x5B8C;&#x4E09;&#x56DB;&#x672C;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x65AD;&#x65AD;&#x7EED;&#x7EED;&#x770B;&#x5B8C;&#x7684;&#x3002;&#x800C;&#x5728;&#x9605;&#x8BFB;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x4E66;&#x7C4D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x8C8C;&#x4F3C;&#x5DF2;&#x7ECF;&#x4E0D;&#x628A;&#x4ED6;&#x4EEC;&#x5F53;&#x4E66;&#x4E86;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x79CD;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x5B9E;&#x529B;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E9B;&#x5E74;&#x6765;&#x4E5F;&#x7B97;&#x662F;&#x770B;&#x8FC7;&#x4E0D;&#x5C11;&#x201C;&#x4E66;&#x201D;&#x5427;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x5C06;&#x6765;&#x8FD8;&#x5C06;&#x7EE7;&#x7EED;&#x770B;&#x4E0B;&#x53BB;&#x3002;&#x770B;&#x7740;&#x7B14;&#x8BB0;&#x672C;&#x4E2D;&#x5B58;&#x7684;&#x5927;&#x91CF;&#x4E66;&#xFF0C;&#x77AC;&#x95F4;&#x6709;&#x70B9;&#x5FC3;&#x7D2F;&#x3002;</p>
<p><img src="http://oe9xsykvg.bkt.clouddn.com/blog/zhuimengfb/books.png" alt=""></p>
<p>&#x4E0D;&#x8FC7;&#x5BF9;&#x4E8E;&#x7A0B;&#x5E8F;&#x5458;&#x8FD9;&#x4E2A;&#x79F0;&#x8C13;&#xFF0C;&#x5C31;&#x610F;&#x5473;&#x7740;&#x8981;&#x4E0D;&#x505C;&#x5730;&#x5B66;&#x4E60;&#xFF0C;&#x65B0;&#x8BED;&#x8A00;&#x4F1A;&#x4E0D;&#x505C;&#x5730;&#x51FA;&#x73B0;&#xFF0C;Kotlin&#x3001;Go&#x3001;Ruby&#x7B49;&#x7B49;&#x90FD;&#x662F;&#x8FD1;&#x4E9B;&#x5E74;&#x624D;&#x6162;&#x6162;&#x53D1;&#x5C55;&#x51FA;&#x6765;&#xFF0C;&#x6280;&#x672F;&#x6808;&#x4E5F;&#x4E0D;&#x505C;&#x5730;&#x66F4;&#x8FED;&#xFF0C;&#x50CF;&#x4E4B;&#x524D;&#x5F88;&#x706B;&#x7684;Android&#x3001;iOS&#x79FB;&#x52A8;&#x7AEF;&#x5F00;&#x53D1;&#x73B0;&#x5728;&#x4E5F;&#x8D8B;&#x4E8E;&#x7A33;&#x5B9A;&#xFF0C;&#x800C;&#x4E4B;&#x524D;&#x4E0D;&#x6E29;&#x4E0D;&#x706B;&#x7684;&#x524D;&#x7AEF;&#x5230;&#x73B0;&#x5728;&#x53C8;&#x6210;&#x4E3A;&#x5927;&#x70ED;&#x7684;&#x6280;&#x672F;&#x6808;&#xFF0C;&#x800C;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x5728;&#x4E0D;&#x4E45;&#x7684;&#x5C06;&#x6765;&#x7ED9;IT&#x754C;&#x5E26;&#x6765;&#x9769;&#x547D;&#x6027;&#x7684;&#x6539;&#x53D8;&#x3002;&#x6240;&#x4EE5;&#x554A;&#xFF0C;&#x8FD8;&#x662F;&#x8981;&#x4E0D;&#x505C;&#x5730;&#x53BB;&#x5B66;&#x4E60;&#xFF0C;&#x4E0D;&#x505C;&#x5730;&#x770B;&#x4E0B;&#x53BB;&#x5427;&#xFF0C;&#x5E0C;&#x671B;&#x5728;&#x5168;&#x6808;&#x7684;&#x8DEF;&#x4E0A;&#x80FD;&#x591F;&#x8D8A;&#x8D70;&#x8D8A;&#x8FDC;&#xFF0C;&#x4E5F;&#x5E0C;&#x671B;&#x548C;&#x6709;&#x5FD7;&#x4E8E;&#x6210;&#x4E3A;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x4F60;&#x5171;&#x52C9;&#xFF01;</p>

      
    </div>
    
    <div>
      
        
      
    </div>

    <div>
      
        
      
    </div>

    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/04/30/如何优雅地从浏览器打开本地应用/" rel="next" title="如何优雅地从浏览器打开本地应用">
                <i class="fa fa-chevron-left"></i> 如何优雅地从浏览器打开本地应用
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2017/06/04/这些年看过的以及即将要看的书/"
           data-title="" data-url="http://yoursite.com/2017/06/04/这些年看过的以及即将要看的书/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            Table of Contents
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            Overview
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/uploads/avatar.png"
               alt="zhuimengfb" />
          <p class="site-author-name" itemprop="name">zhuimengfb</p>
          <p class="site-description motion-element" itemprop="description">微信公众号zhuimengfbi同步更新，欢迎关注</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">26</span>
              <span class="site-state-item-name">posts</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">4</span>
                <span class="site-state-item-name">tags</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#tag-杂七杂八"><span class="nav-number">1.</span> <span class="nav-text">tag: 杂七杂八</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#Android系列"><span class="nav-number">2.</span> <span class="nav-text">Android系列</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#Java系列"><span class="nav-number">3.</span> <span class="nav-text">Java系列</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#Java-Web系列"><span class="nav-number">4.</span> <span class="nav-text">Java Web系列</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#Coding"><span class="nav-number">5.</span> <span class="nav-text">Coding</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#在看书的路上越走越远"><span class="nav-number">6.</span> <span class="nav-text">在看书的路上越走越远</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">zhuimengfb</span>
</div>

<div class="powered-by">
  Powered by <a class="theme-link" href="http://hexo.io">Hexo</a>
</div>

<div class="theme-info">
  Theme -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Muse
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"zhuimengfbblog"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  
  

  

  

</body>
</html>
